[
  {
    "company_name": "TCS",
    "year": "2024",
    "sector": "IT",
    "source_url": "https://www.bseindia.com/stockinfo/AnnPdfOpen.aspx?Pname=d57e49b6-fd89-4fa8-b591-4f590100db1e.pdf",
    "mda_text": "Management Discussion and Analysis................................ 69 Awards and Accolades......................................................... 91 Corporate Governance Report............................................ 93 Corporate Social Responsibility........................................... 117 Business Responsibility and Sustainability Report............... 127 Integrated Annual Report 2023-24 4 Board of Directors Board of Directors Non-Independent, Non Executive Independent, Non Executive N Chandrasekaran Aarthi O P Dr Pradeep Kumar Hanne Chairman Subramanian Bhatt Khosla Sorensen C C M N M N C M M I C M I M M I Non-Independent, Executive K Krithivasan N G Subramaniam Keki Al-Noor CEO & MD COO & ED Mistry Ramji C C M I M M I M M M NE M M NE 65 I Independent, Non-Executive Director Average Age (years) 57 73 NE Non-Independent, Executive Director N Non-Independent, Non-Executive Director Average Tenure on 07 the Board (years) 0 17 Board Committees C Chairman M Member Board Independence (%) Audit Committee Nomination and Remuneration Committee Stakeholders Relationship Corporate Social 56% 44% Committee Responsibility Committee Independent Non-Independent Executive Risk Management Committee Committee Average Tenure of Independent 06 Samir Seksaria (Chief Financial Officer), is also a member of the Committee Directors on the Board (years) 0 12 Integrated Annual Report 2023-24 Management Team 5 Management Team Corporate K Krithivasan Dr. Harrick Vin Chief Executive Officer and Managing Director Chief Technology Officer N G Subramaniam Abhinav Kumar Chief Operating Officer and Executive Director Chief Marketing Officer Samir Seksaria Madhav Anchan Chief Financial Officer General Counsel Legal Milind Lakkad Pradeep Manohar Gaitonde Chief Human Resources Officer Company Secretary Business Heads Industries Susheel Vasudevan Anupam Singhal Banking Financial Services and Insurance Manufacturing Shankar Narayanan V Rajanna Banking Financial Services and Insurance Technology, Software and Services Debashis Ghosh Akhilesh Tiwari Life Sciences, Healthcare, Energy, Resources and Utilities Communications, Media and Information Services Krishnan Ramanujam Consumer Business Group Markets Suresh Muthuswami Sapthagiri Chapalapalli Chairman TCS North America Europe Amit Bajaj Girish Ramachandran North America Growth Markets Amit Kapur UK & Ireland Services Siva Ganesan Ashok Pai AI.Cloud Enterprise Cognitive Business Operations Vikram Karakoti Regu Ayyaswamy Enterprise Solutions IOT & Digital Engineering Ganesa Subramanian Vaikuntam Kamal Bhadada Cyber Security TCS Interactive Integrated Annual Report 2023-24 6 Letter from the Chairman Across industries globally, there are multiple mega trends that are shaping priorities of businesses: AI, New Energy, Supply Chain and Talent. These transitions will require substantial investment in technology across industry sectors. Your company is making significant investments and building capabilities to partner with customers during this phase of rapid technological shifts. Letter from the Chairman Dear Shareholder, In FY 2024, your company has continued to deliver strong After two years of recessionary fears, persistently high performance. I am pleased to share with you that your company inflation, and unprecedented monetary tightening, the global has crossed annual revenues of 240,893 crore, a growth of macro-outlook looks relatively better now with improving 6.8%, over the previous year. With relentless focus on operational growth, disinflation, and monetary easing in sight. excellence, this growth has come at an industry leading operating Across industries globally, there are multiple mega trends that margin of 24.6% , an increase from 24.1% last year. The order are shaping priorities of businesses: AI, New Energy, Supply book for FY 2024 came at an all-time high of US$ 42.7 billion Chain and Talent. supported by strong client relationships and engagement. Client metrics continue to exhibit healthy progress with strong client GenAI technologies will impact almost every sector and additions. Employee retention continues to be at benchmark country going forward. Enterprises have already invested levels in the industry. TCS has been selected as a Top Employer of in cloud, data infrastructure and large processing power Choice in 32 countries. TCS has retained its ranking as the second which will aid AI/ GenAI. GenAI will not only improve most valuable global IT services brand, valued at US$19.2 billion, productivity, but also create impact we hitherto have not an increase of US$2 billion from last year. seen or imagined. The global environment around the world continues to go Global energy transition is accelerating, and businesses through significant shifts. Post the pandemic, which resulted in are making clear commitments towards a sustainable supply chain shocks, there was an economic slowdown especially future. The energy requirement of our fast-changing world in developed markets. While initial signs of stability began to is enormous. Key is to lower the cost of energy while also emerge, the military conflicts have further intensified this year transitioning to renewables. This transition requires large and continue to impact the global supply chains. investment in technology, electric mobility, renewable power, hydrogen and sustainable fuel. Excludes settlement of legal claim Integrated Annual Report 2023-24 Letter from the Chairman 7 Geo-political challenges are continuing to alter established These transitions will require substantial investment in supply chains and companies are rebalancing their supply technology across industry sectors. Your company is making chains to address both resilience and efficiency. New global significant investments and building capabilities to partner with supply chain ecosystems are being created, with India customers during this phase of rapid technological shifts: playing an important role in advanced manufacturing. In FY 2024, TCS has consolidated AI and Cloud expertise Advanced manufacturing, new technologies like AI, new with the creation of the AI.Cloud unit. In addition, each energy, data and business models are changing the future of the business groups are developing domain-specific of work and are compelling new skillsets to be built for the AI/GenAI offerings relevant to the industry value chain. future. Over 300,000 employees have been upskilled on GenAI technologies in FY 2024. TCS products and services are Secure networks have become a key necessity as data is the also being enhanced with AI capabilities. For example, TCS foundation for businesses of today. These networks power BaNCSTM is enriching its product portfolio with integrated everything from predictive analytics and AI to personalized AI/ML and GenAI capabilities; AI is also being embedded in customer experiences. As value of data increases, along Cybersecurity services to enable predictive capabilities. with concerns of privacy and protection, it has rightly become a focal point of security for all businesses. To partner with customers on their energy transition agenda, TCS is investing in research on green hydrogen, The key question is what these disruptions mean to the IT biofuels; developing digital platforms to help customers services industry and how your company is preparing for these? reduce Scope 1/2/3 emissions. Our proprietary ESG As enterprises globally prepare to respond to these mega framework enables enterprises to build transparency into trends, we see multiple opportunities for your company. Every operations and simplifies compliance reporting. industry is embracing these trends and their business is being shaped for the future. For example: TCS is pioneering the engineering of the 5G/6G communication stacks using open standards. Two The deployment of AI and GenAI will significantly help state-of-the-art labs for future ready communication financial institutions in both driving efficiency as well infrastructure and interoperability have been setup at as target new customers and serve customers in a very Bengaluru and Gurugram. Investments are being made in personalized manner. For example, Insurance claims multiple niche technologies such as 5G SA Core, O-RAN will be processed in a matter of minutes, lending and radios, to build these solutions indigenously. disbursements will become much faster. Your company continues to invest in upskilling its talent Adoption of new energy solutions and AI technology is base of over 600,000 employees. Employees are actively driving the future of automobiles. It is not only driving leveraging experiential and personalized learning on a wide reduction of emissions but also providing a new level of range of emerging technologies, clocking over 51 million customer experience. learning hours in FY 2024. TCS continues to build strong talent supply chains with deep partnerships with leading AI is accelerating drug development by screening millions educational institutions, shaping the curriculum for new of compounds, predicting interactions and generating new skill needs for the future. candidates for testing. On behalf of the Board of Directors of the company, I want to Connected medical devices together with AI and GenAI will thank you for your continued trust, confidence, and support. transform Healthcare in a significant way. It will enhance productivity, enable remote care and help overcome Warm regards, shortage of skilled resources. N Chandrasekaran Chairman In Advanced manufacturing, an AI-first approach will drive new benchmarks in productivity, efficiency and sustainability. Telecom industry globally is upgrading communication infrastructure to 5G/6G. These high speed, low latency networks, along with edge compute and AI will become the backbone of businesses in future. Integrated Annual Report 2023-24 8 Letter from the CEO The rise of GenAI has been catching customers attention, and it promises a leap in productivity and accelerates the creation of new products and services. Although still in the early stages of adoption, the use of GenAI is expected to transform every industry. Letter from the CEO1 The Earnings Per Share was at 127.742, a growth of 10.9% over the prior year. Among the Business Segments, Manufacturing grew 10.6%, Life Dear Stakeholder, Sciences and Healthcare grew 8.7%, Banking, Financial Services It is my privilege to be writing to you from this desk as we near and Insurance grew 5.6%, Consumer Business grew 4.9%, 20 years to our listing since August 25, 2004. Over the last two Communication, Media and Technology grew 4.6%, while Others decades, your company s Revenue and Net Profits have grown grew 14.5% (YoY in reported currency). at a compounded annual growth rate of over 18% each. Among geographies, growth was led by emerging markets: Latin It has been almost a full year since my transition as CEO, America grew 21.1%, India grew 20.3%, Middle East & Africa and I am happy to report that it has been a very stable and grew 14.8% while Asia Pacific grew 4.0%. The UK grew 17.7%, seamless experience for all our stakeholders. During this Continental Europe grew 6.5%. North America grew 2.3% (YoY in period, we refocused on our industry and technology expertise, reported currency). emphasized and refreshed the core values that define who we are as a company, and doubled down on customer centricity We are seeing strong deal momentum across markets resulting and employee empathy. in double-digit growth in our TCV of US$ 42.7 billion, which reflects our deepening partnership with our clients and gives us We had a strong finish to the fiscal year FY 2024, with revenue optimism for the medium to long term growth outlook. for the year at 240,893 crore. This is, a growth of 6.8% over the previous year (3.4% in constant currency). Demand for In keeping with our capital allocation policy of returning our services showed remarkable resilience as macroeconomic substantial free cashflow to shareholders, the Board has uncertainties and geopolitical volatilities continued in major recommended a final dividend of 28 per share, bringing the markets through the year. total dividend for the year to 73 per share. The company also successfully completed its fifth buyback program, distributing This growth came with an industry leading operating margin of 17,000 crore to shareholders. For the full year, the company s 24.6%2. More importantly we exited the year with a quarterly shareholder payout was 47,445 crore, which will be our largest operating margin of 26% in Q4, demonstrating our commitment payout to date. Our average shareholder payout has been more to the margin band of 26% to 28%. Our Net Margin was at than 100% during the last 5 years. 19.3%2. 1GRI 2-22 2Excludes settlement of legal claim IInntteeggrraatteedd AAnnnnuuaall RReeppoorrtt 22002233--2244 Letter from the CEO 9 Business Overview The rise of GenAI has been catching customers attention, and Established in 1968, our company has been a pioneer in the it promises a leap in productivity and accelerates the creation IT industry, across various technology cycles. At each of these of new products and services. Although still in the early stages defining moments, we refocused our investments, reinvented of adoption, the use of GenAI is expected to transform every ourselves, and helped clients transform their businesses to stay industry. Many of our clients who are early adopters have begun ahead of the technology curve. experimentation and exploration on various use cases of GenAI, with our help. During FY 2024, customers continued reprioritization of projects in favor of those which are considered business- The Innovation Edge critical and where ROI realization is likely faster. We continue Exploring innovative uses of GenAI continues to be a key to see pressure on customers discretionary spending. The focus area. We are helping our customers to use AI to: recently won deals are converting into revenue as planned, (i) Assist, leveraging AI to supplement tacit knowledge with the ongoing engagements started during the pandemic are contextual knowledge to boost work effectiveness (ii) Augment, being re-examined for the incremental value generated. While accelerating elite performance through collaborative transformation remains a key ask, customers are expecting the intelligence, where humans and machines complement and same to be funded through savings from operations. Hence, the magnify each other s talents, and (iii) Transform, leaping to a key engagement themes we saw during the year were around knowledge-driven superstructure with fast, consistent, and cost optimization and cloud transformation. high-quality decision output to deliver new ways of working and the full realization of enterprise-wide AI. We have created one Demand was led by vendor consolidation, cloud migration of the largest AI / ML and GenAI talent pools in the industry. We and transformation, customer and employee experience have doubled down on partnerships in areas such as AI, cloud, enhancement, operating model transformation, business quantum computing and cybersecurity. These early investments process optimization, supply chain initiatives, sustainability, AI have given TCS a head start in being a partner in our customers enablement i.e. creating a cloud and data foundation for AI, and technology adoption journey. early-stage AI-infused transformational engagements. With our contextual knowledge and domain expertise, Today, clients are seeing cloud as a strategy for business engineering DNA and intellectual capital, we have been the transformation and growth. The shift to cloud-native products preferred partner for many customers in their strategic and platforms is being fast-tracked, to achieve increased initiatives. This year, we signed several deals that are collaboration, security, scalability and efficiency. Hybrid, industry- defining in nature. We have included narratives about multi-cloud platforms are now becoming mainstream. Cloud the work we did for BSNL building an indigenous network, a adoption is is a catalyst for innovation, and a strategy for true nation building project and how we built an advanced post business and growth itself. It provides the unifying digital fabric trading platform for SIX in this Integrated Annual Report. that forms the foundation for a connected future one that continues to unfold with each technological advancement, Our continued investments in Research and Innovation, and in including generative AI (GenAI). building intellectual property, have further strengthened our transformational credentials. Many of our earlier R&I programs have matured into successful platforms and solutions which performed very well this year and helped differentiate our growth. We leveraged TCS HOBSTM to transform Celcom Axiata Berhad s core business support systems. For PostNord, TCS TwinXTM is helping increase sorter capacity, remove bottlenecks, and improve the collection and distribution sort plan. Similarly, We launched several initiatives this year to TCS OmnistoreTM is helping European home improvement company Kingfisher orchestrate a faster, smoother, and seamless inculcate a strong engineering culture among checkout experience. our employees and build deeper skills in market relevant technologies like Cloud, AI, Building a Skilled Workforce Our approach to talent is strategic we consider our employees Cyber Security and more. TCS is collaborating as key stakeholders in our growth. Our ability to cycle through with all the hyperscalers and entering new different technology and business model changes, continuously partnerships with other important players in embrace new knowledge and stay relevant, defines us and gives us a significant edge over our competitors. the AI ecosystem to upskill at scale and build AI computing infrastructure to develop AI We have a strength of 601,546 employees, and our LTM attrition solutions for our customers. in IT services was 12.5%, down by 760 bps over the previous year. Our workforce continued to be very diverse, with over 152 nationalities represented and with women making up 35.6% of the employee base. Integrated Annual Report 2023-24 10 Letter from the CEO We launched several initiatives this year to inculcate a Through clearly defined focus areas and strategic programs, our strong engineering culture among our employees and build work has impacted the lives of over 7.1 million people. We are deeper skills in market relevant technologies like Cloud, AI, working with public and social sector organizations to help close Cyber Security and more. TCS is collaborating with all the the literacy gap among the most marginalized adults, helping hyperscalers and entering new partnerships with other them access government entitlements and improving access to important players in the AI ecosystem to upskill at scale and livelihood. We are empowering students in government schools build AI computing infrastructure to develop AI solutions for our with 21st century skills, introducing them to careers of the customers. future, while empowering and building capacity of the teachers and education system. In FY 2024, TCSers logged 51 million learning hours, and acquired nearly 5 million competencies. A culture of lifelong By working with other private sector organizations, we are learning and innovation, by closely linking learning with careers helping marginalized youth transition from college to meaningful and rewards, has placed us as the Global Top Employer for the careers across a variety of sectors. Our digital entrepreneurs are 9th consecutive year, across 32 countries placing us as one in connecting disadvantaged communities in rural and aspirational only 16 organizations worldwide to achieve this status. districts across India with front line services in social welfare, banking, finance, insurance, health, e-commerce, logistics and Embracing Aalingana more. We have fully adopted Project Aalingana, the Tata group s sustainability roadmap and the aim is to be net zero by Our employee volunteer program called HOPE (Hours of 2045, integrating sustainability into business strategy and Purpose by Employees) resulted in over 6.7 million hours concentrating on three interlinked pillars of the project, i.e., dedicated to purpose projects across dimensions of biodiversity, promoting the decarbonization of our company and value mental health, climate action, circularity, literacy, education, chains; utilizing a systematic, circular economy approach skilling, mentoring, conservation and more covering the 17 UN to reduce resource usage and waste; and protecting and Sustainable Development Goals. regenerating the environment. Greater Governance We continue to make good progress in our net zero journey, Governance at TCS encompasses ensuring ethical and on the environmental front. TCS had set a target to reduce its transparent business conduct, addressing sustainability risks and absolute Scope 1 and Scope 2 emissions by 70% by 2025 and opportunities and aligning robust disclosure requirements under become net zero by 2030. We are well ahead of our initial Scope the aegis of the board. At TCS, the Tata Code of Conduct serves 1 and 2 targets and have achieved a reduction of 80% in Scope as a guide for all employee behavior. 1 and 2 emissions in FY 2024 over a baseline of 2016. We are doing this by increasing use of renewable sources of energy and TCS consciously embeds the highest standards of governance improving energy efficiency. in its operations. We have a holistic compliance framework and an integrated governance structure that encourages a strong The company s strategy for reducing emissions includes addition commitment to global Environment, Social and Governance of more green buildings to the company s real estate portfolio, (ESG) disclosure standards for promoting transparency and reduction of IT system power usage, responsible sourcing, and accountability. As part of the Tata Group, we have long the use of TCS Clever EnergyTM, which leverages IoT, machine recognized the ESG stewardship as core to our purpose. We have learning and AI to optimize energy consumption across a proud legacy of pioneering positive change, not just within the campuses. industry but in the communities where we operate as well, and our commitment remains steadfast. TCS is not only improving its own sustainability but also helping clients develop and implement their sustainability strategies Looking Ahead and improve outcomes. We have built a comprehensive suite of Our all-time high order book, continued deal flow and pipeline over 200 offerings in sustainability services and solutions across velocity give us confidence in our business momentum. Looking different industry verticals. These solutions help enterprises forward, we see greater opportunities ahead, as businesses decarbonize their operations and create net-zero pathways, become more technology-intensive and depend on technology addressing biodiversity loss and growing inequity. We help to drive competitive differentiation and transform their customers embed circularity in their products and services, by industries. Our integrated business model which drives value helping design agile, resilient, and sustainable supply chains and creation for all our stakeholders, will continue to help us benefit promoting reuse, recapture, and recycling. from each new wave of technology change, and be a force multiplier for our growth and leadership in years to come. We Passion for Our Purpose thank you for your continued support in our journey ahead. TCS is meaningfully connecting marginalized groups, including women and youth, to economic opportunities. We continue Best regards, to work with communities across the world, pursuing our K Krithivasan long-standing commitment to programs in the areas of Chief Executive Officer and Managing Director education, literacy for livelihood, skilling for employment, and digital entrepreneurship; while exploring areas of healthcare, digital inclusion, water, climate and sustainability. Integrated Annual Report 2023-24 The Year Gone By 11 The Year Gone By Announced a 15-year expansion of its partnership with Aviva, the UK s leading insurance, wealth and retirement provider, Q4 to transform Aviva s UK life business and enhance customer experience leveraging the TCS BaNCSTM platform. As part of this, Featured on FORTUNE the end-to-end policy administration and Magazine s 2024 list servicing will expand to cover over 5.5 of the World s Most million policies. Admired Companies, also featured in the Forbes Announced a final dividend of 28 per Global 2000 Rankings of share, taking the total dividend for the year to 73 per share. the largest companies in The company also completed its fifth successful buyback the world. returning 17,000 crore to shareholders, wherein the buyback process was completed in record time of 63 days. The total shareholder payout for the year was 47,445 crore. Recognized as a Global Top Employer by the Top Employers Institute for the ninth consecutive year, for TCS pioneering employee engagement and talent development initiatives. TCS From Fortune, 2024 Fortune Media IP Limited. All rights reserved. Used under license. was also named a top employer in 32 countries and regions, including Europe, the UK, the Middle East, North America, Latin Ranked the second most valuable IT services brand (brand America, and South-East Asia. value up 11.5% to US$19.2 billion) by Brand Finance, with the incremental US$2 billion growth being the highest absolute Ranked the #1 IT service provider for customer satisfaction growth posted among the Top 25 leading IT firms in the world. in Europe in an independent survey of over 2,000 CXOs of the continent s top IT spenders by Whitelane Research, for Former Executive Director, Phiroz Vandrevala, passed away in the 11th consecutive time. The study also revealed that TCS January 2024. He was a key part of the leadership team and demonstrated an exceptional level of performance across five made many significant contributions, such as being part of the key IT domains: Digital Transformation, Workplace Services, efforts to take TCS public in its IPO in 2004, opening-up new Security Services, Application Services and Cloud Services, where markets, mentoring a new generation of TCSers, and in building TCS scored more than 80%, and maintained a healthy lead a strong foundation for the company in the life and pensions compared to industry average scores. industry. Launched an AI Experience Zone to foster hands-on proficiency Enabled Europe s most modern post-trade platform with in AI and GenAI for its employees. Within this immersive Euroclear Finland, the national central securities depository environment, TCS employees can explore, engage, and of Finland, to integrate its core platform with the European experiment with cutting-edge GenAI-powered applications, securities settlement engine. This transformation program creating innovative use cases, with all necessary guardrails and ensures easier cross-border settlements for investors in Finnish while upholding Responsible AI principles. securities, attract more investment into the country, improve access to capital for Finnish issuers and also reduce cross-border settlement risks and costs for investors. Launched TCS Pace PortTM London, the company s sixth global research and co-innovation hub, which is set to become a dynamic center for cutting- edge technology research and development in the region. The Pace Port will focus on innovation across a cross-section of industries, government priorities and critical national infrastructure while creating an ecosystem of experiences. Integrated Annual Report 2023-24 12 The Year Gone By Sponsored 13 running events through the year, including the Partnered with Macquarie University to launch the TCS GoZero TCS New York City Marathon, TCS Amsterdam Marathon, TCS Hub, a research and innovation center to guide Australian London Marathon, TCS Toronto Waterfront Marathon and organizations in their journeys towards net zero carbon TCS Lidingo loppet, where total distance covered by the runners emissions. Aligning with the central themes of COP28, this crossed more than 80 million miles. hub will focus on five core themes energy transition, carbon management, nature positive future, circular economy and sustainable waste management, and climate adaptation and resilience and how to limit and prepare for future climate change. The TCS GoZero Hub will also support education pathways, providing relevant skills and knowledge to prepare students for successful, future-focused careers. TCS New York City Marathon TCS London Marathon Professor Dan Johnson, Pro Vice-Chancellor Research, Innovation and Enterprise, Macquarie University; K. Krithivasan, CEO & MD, TCS; and Girish Ramachandran, President, TCS Growth Markets at the launch of the TCS GoZero Hub in Sydney. Paid tribute to the passing away of Mr. Y P Sahni, one of the TCS Toronto Waterfront Marathon members of the original founding team at TCS, who laid the foundations of the company and served as the President till his retirement in 1996. Selected by ASX, Australia s primary securities exchange to provide Signed a multi-year partnership with ASDA in a divestiture a next generation clearing and and digital transformation deal, to help implement a new Q3 settlement platform to service the organization-wide IT operating model, following its divestiture Australian market. TCS will leverage from Walmart. The strategic partnership will leverage TCS cloud, its flagship product TCS BaNCS for AI, and security solutions to help ASDA deliver the divestiture Market Infrastructure to enable the smoothly, on-time and securely, in addition to further enabling transformation, replacing ASX s existing ASDA in enhancing its customer experience and innovation platform for cash equities clearing and capabilities to help increase their market share and retain price settlement. leadership. Partnered with The Munch Museum in Oslo, to Selected by TPG Telecom, Australia s leading create immersive and interactive drawing experiences for local telecommunications company, as a strategic technology visitors and global audiences. Scientists from TCS Research transformation partner, to simplify and streamline internal will leverage their expertise in AI and Machine Learning to systems and platforms, enhance customer journeys and bring Edvard Munch s artworks and creative process to life products, and increase digitisation. This will help TPG Telecom through the power of digital innovation. TCS will also provide IT become Australia s best digital telco by delivering great value consultancy, collaborative workshops, and talent exchanges to connectivity services to end customers. help create immersive museum experiences that showcase the future of art. Integrated Annual Report 2023-24 The Year Gone By 13 Partnered with SIX, the operator of the Swiss and Spanish ecosystems, opening-up possibilities of innovative new products financial market infrastructures, to transform its post trade nd services. The program is more scalable and currently market infrastructure, which offers greater flexibility, security, processes more than 4 million transactions per day, covering and ease of maintenance and its modern, cloud-ready more than 60 global markets. architecture can also integrate more easily with digital The signing of the Swiss Securities Clearing Corporation (SECOM) deal in 1989, marked TCS entry on the global stage, competing with a select set of large consulting firms for executing large, complex programs involving deep domain expertise. SIX mission critical core platform was originally built by TCS, and was one of the world s first online real-time settlement systems. Selected by BSNL, state-owned telecom Choosen by British Council, the UK s international organization operator of Government of India, for educational opportunities and cultural relations, to transform to roll out a modern 4G/5G mobile its professional services function that includes Finance, Q2 communication infrastructure across Procurement, Human Resources and Digital & Technology. TCS India covering 100K telecom sites, as part will leverage its contextual knowledge, deep domain expertise of its efforts to build indigenous telecom and proprietary platforms to help develop more innovative technology and local manufacturing of and user-friendly services. The partnership will also enable the the telecom gear. British Council to focus on improving the quality and efficiency of services, ultimately leading to an enhanced customer Partnered with JLR, a large UK based experience. multinational automobile company, to accelerate digital transformation across its business, Selected as a strategic partner by the Government of India to TCS will deliver a broad range of services spanning application transform the Government e-Marketplace (GeM) platform, into development & maintenance, enterprise infrastructure a world-class platform. The project will enable growth and scale, management, cloud migration, cybersecurity, and data services. improve inclusivity for MSME enterprises, enhance data analytics TCS will help JLR transform to a leaner and scalable operating for improved supply-chain operations and provide enriched user model with a future-ready digital core, by leveraging new experience through innovation and domain expertise of TCS. technologies to transform IT operations and adopting new ways of working. Integrated Annual Report 2023-24 14 The Year Gone By Partnered with Dassault Syste mes through its Living Heart Created the first-ever digital heart of long-distance runner, Project that unites an ecosystem of cardiovascular researchers, two-time Olympian, and Boston Marathon champion Des educators, medical device developers, regulatory agencies Linden. The twin will help see, measure, and monitor the including US FDA, and practicing cardiologists, to develop and heart going through significant stress and predict with validate realistic digital simulations of the human heart. The TCS high accuracy how it will perform, to transform how the Bio Digital Twin is a biophysics-based high-fidelity computational athlete trains. model developed by TCS researchers, to enable investigation of the function of a particular human organ remotely and non-invasively. At the 2023 TCS New York City Marathon Expo at the Javits Center in New York City, two-time Olympic marathoner Des Linden (right) examines a digital twin of her heart being developed by Tata Consultancy Services, next to Dr. Srinivasan Jayaramen, Principal Scientist at TCS. TCS is developing a digital twin version of her heart to showcase how digital twin technology is set to transform how elite athletes train, compete, and manage their health while demonstrating the power and potential of personalized health and wellness. (Photo credit: Joe Hale) Selected by Nest, UK s largest workplace Celebrated 20 years in Mexico by inaugurating a new office in pension scheme, to digitally transform Monterrey, becoming TCS ninth office in the country overall, its scheme administration services with a state-of-the-art building which is one of the tallest in the Q1 with a future-ready, digitally enabled, cities. TCS serves more than 250 clients out of these centers. omnichannel platform powered by TCS BaNCSTM. TCS will leverage the latest technologies and data analytics to deliver enhanced, personalized, and self-directed experiences to members. This will enable Nest s 12 million members and 1 million employers to access the right information at the right time, in the way that suits them best. Awarded a 10-year contract by the UK s Department for Education (DfE) to manage the scheme administration services and further enhance customer experiences for the Teachers Pension Scheme in England and Wales. TCS future-ready, digitally enabled, omnichannel platform, powered by TCS BaNCSTM, will enable accurate administration of pension records, payment of benefits, effective scheme finance management, proactive member engagement and easy access to information. Engaged by Standard Life International DAC, a wholly owned subsidiary of the Phoenix Group, to transform its operating model and enhance the customer experience for its policyholders in Europe, using the TCS Digital Platform for Life and Pensions, powered by TCS BaNCS. TCS will set up a customer operations center in Germany, and a future-ready Life and Pensions Digital Platform for Germany and Austria. As part of the transformation, TCS will create comprehensive, omnichannel, journey-based digital experiences for policyholders and advisors. Integrated Annual Report 2023-24 TCS Integrated Business Model 15 TCS Integrated Business Model Value Creation using the Five Capitals al t G o o E m d p w lo y i e ll e s , C o In m v e s m to r u s , n C u it s i t e o S m o s c e ia r l s C , a p it a l o S p o e u ra r F c ti e i o n s n o a s f , n f f a i u c n c n t a i i d a n v s i c l t i f i n c e ro g s a m o p r b i i t n u a v si e l n s e ti s n s g I n t ell e c t u al D C o a p m i C a o i n n k t n e o x w I t l n e u d a t g e l e k l n l e o w ct l e u d a g e l Pr o p ert y N on-ren R N e e a w ne t a w u bl a r e b a R le l e a s C o n a u d r p ce it s al H ca u p S m a k m b i o l i l t l s a i i t , v n i c a e o t s i C m , o k n p a n e o p o t f w e i t e n le a m c d i l e p g s l e o , a ye n e d s Operations Stakeholder Payout, Reserves Research & Innovation Products & Platforms Services & Solutions Sales, Project Management, Partners Delivery, Quality Management Technology and Customer Co-Innovation Network (COIN) Goodwill/Brand Value/CSR/Taxes Talent Acquisition Talent Engagement Talent Development Contextual Knowledge Value CUSTOMER ENGAGEMENT Integrated Annual Report 2023-24 Financial Capital TCS longevity is a testimony to the strength of our business model and our ability to reinvent ourselves in an ever-evolving technology landscape to stay relevant to our customers while remaining focused on creating value for all our stakeholders. Outcomes Best in class profitability and strong Superior Return Sustained long term Consistently high",
    "overall_tone": null,
    "extracted_at": "2025-08-02T21:16:27.834174"
  },
  {
    "company_name": "TCS",
    "year": "2023",
    "sector": "IT",
    "source_url": "https://www.bseindia.com/stockinfo/AnnPdfOpen.aspx?Pname=\\3837c1b7-9308-436d-9636-1d6856edf74e.pdf",
    "mda_text": "Management Discussion and Analysis................................ 86 Awards and Accolades......................................................... 109 Corporate Governance Report............................................ 113 Corporate Social Responsibility........................................... 136 Business Responsibility and Sustainability Report............... 145 Content 3 Board of Directors Non-Independent, Non Executive Independent, Non Executive N Chandrasekaran Aarthi O P Bhatt Dr Pradeep Kumar Hanne Sorensen Chairman Subramanian Khosla C C M N M N C M M I C M I M M I Non-Independent, Executive K Krithivasan N G Subramaniam Keki Mistry Don Callahan CEO & MD COO & ED M M M NE M M NE C C M I M M I I Independent, Non-Executive Director 63 NE Non-Independent, Executive Director Average Age (years) 56 72 N Non-Independent, Non-Executive Director Board Committees C Chairman M Member Average Tenure on 07 the Board (years) 0 16 Audit Committee Nomination and Remuneration Committee Board Independence (%) Stakeholders Relationship Corporate Social Committee Responsibility Committee 56% 44% Independent Non-Independent Executive Risk Management Committee Committee Average Tenure of Independent 06 Samir Seksaria (Chief Financial Officer) is also a member of Directors on the Board (years) 04 11 the Committee Board of Directors 4 Management Team Corporate Business Heads K Krithivasan Susheel Vasudevan Chief Executive Officer Relationship Incubation Group and Managing Director Krishnan Ramanujam Enterprise Growth Group N G Subramaniam Chief Operating Officer Debashis Ghosh and Executive Director Business Transformation Group Samir Seksaria Suresh Muthuswami Chief Financial Officer Chairman TCS North America Milind Lakkad Amit Bajaj Chief Human Resources Officer North America Rajashree R Amit Kapur Chief Marketing Officer UK & Ireland K Ananth Krishnan Sapthagiri Chapalapalli Chief Technology Officer Europe Madhav Anchan General Counsel Legal Pradeep Manohar Gaitonde Company Secretary Management Team 5 Letter from the Chairman The global environment is going through considerable changes. At the same time, the world is navigating several important transitions: the Energy transition, the Supply Chain transition and the AI transition. Undoubtedly, these transitions will require significant investments in technology and innovation, and offer a huge growth opportunity for the IT industry. Letter from the Chairman 6 Dear Shareholder, a central focus. The impact of AI and Machine learning is going to be profound. There is a transition already underway from I am pleased to share that your company has done well in a predictive AI to generative AI. Majority of the businesses are volatile global environment in the year gone by. In FY 2023, still adopting predictive AI and are on the journey of capturing your company delivered revenue of 225,458 crore, a growth of large volume of data, harnessing the power of cloud and IoT. 17.6%. This growth has come at an industry-leading operating There are varying levels of adoption in companies across sectors. margin of 24.1%. Leveraging generative AI would further require technology innovation and investments. TCS continues to play a crucial role with clients to enable their business transformation, helping them accelerate new There is another important area that companies need to focus technology adoption and bring agility into execution. We work on building talent for the future. The energy, supply chain and with large enterprises on transformation initiatives to build a AI transitions are going to require companies to reskill/upskill digital foundation for the future, enable strategic leverage of existing talent base, hire and integrate new talent and invest data and artificial intelligence (AI) and reimagine customer and in research. Our technology strengths make us well-placed to employee experiences. respond to the global demand and scale up our talent base. Your company delivered healthy client metrics enabled by As the future of work is evolving, enterprises globally are also new customer additions and deep client relationships. assessing their approach to talent. Today, companies can tap In FY 2023, growth has come from broad-based performance into talent anywhere and leaders need to learn how to harness across markets and industry verticals. The order book continues the global talent pool effectively. Technology and tools are to be strong, indicating demand for your company s services. facilitating collaboration and enabling virtual and hybrid models From a talent perspective, the employee strength grew to over of work. Harnessing this talent will need an approach that 614,000 associates with 35.7% women associates. leverages technologies like AI and cloud to enable effective employee engagement and collaboration. The global environment is going through considerable changes. Geopolitical factors such as the conflict between Russia and Your company is significantly investing in building AI capabilities Ukraine, rising inflation and volatile commodity prices have which include products and platforms that are AI-powered. caused slowing down of global growth and created stress in the Over the last few years, your company has leveraged overall economic environment. partnerships to design and orchestrate a completely indigenous software-defined 4G/5G network stack. 5G technologies along At the same time, the world is navigating several transitions. with IoT, edge and AI will enable new digital transformation Undoubtedly, these transitions will require significant opportunities across industries, both industrial and consumer. investments in technology and innovation, and offer a huge We will also invest in research areas important for the future, growth opportunity for the IT industry. in collaboration with our global academic partners and start-up ecosystem. The global energy transition is accelerating. Businesses are making clear commitments towards a sustainable future. I would like to thank Rajesh Gopinathan for his contribution There are many innovations across products, services, during his tenure as CEO & MD and I wish him the very best for manufacturing, and delivery. New business models are also the future. I also take this opportunity to wish K Krithivasan the emerging. This requires investments in technology and very best in his new role as CEO & MD of your company. innovation including electric mobility, renewable power, hydrogen and sustainable fuel. In addition, sustainability On behalf of the Board of Directors of Tata Consultancy Services, compliance and reporting requirements are fast evolving as new I want to thank you for your continued trust, confidence, and standards and regulations are coming into play. Across the facets support. of this transition, investments in IT and digital technology will be an important enabler for businesses. Warm regards, N Chandrasekaran The supply chain transition resulting from the geo-political Chairman situation is altering the global supply chains. Companies are rebalancing their supply chains for resilience and efficiency. New global supply chain ecosystems are being created with India playing an important role. This is being led by significant capital investments in technology to set-up digital-first manufacturing and supply chain operations as well as to build ecosystem integration with partners. In the past decade, there has been a rapid evolution of digital technologies, bringing about a transformation across every industry. Now, the advancements in AI have made AI transition Letter from the Chairman 7 Our full services capability enables us to help our clients thrive, in good times and bad. During the up-cycle, we help clients accelerate and expand their technology-led innovation to differentiate themselves and drive growth. On the down cycle, we help them adapt, using technology to drive the efficiency, agility and resilience needed to cope with a faltering economy, and prepare for better times ahead. Letter to Shareholders1 Dear Stakeholder, Demand for our services showed remarkable resilience even as other parts of the technology universe deflated, and macroeconomic uncertainties worsened in our major markets throughout FY 2023. Our revenue for the year was 225,458 crore, a growth of 17.6% over the prior year (13.7% in constant currency). This growth came with an industry leading operating margin of 24.1%. Our Net Margin was at 18.7%. The Earnings Per Share was at 115.19, a growth of 11.2% over the prior year. From an industry vertical perspective, growth in FY 2023 was led by Retail and Consumer Business, which grew 22.1%, Life Sciences and Healthcare which grew 20.2% and Communications, Media and Technology which grew 18.1%. technology to drive the efficiency, agility and resilience needed Banking, Financial Services and Insurance grew 14.6% while to cope with a faltering economy, and prepare for better times Manufacturing grew 14.1%. Others, which make up 8.2% of ahead. revenues, grew 22.5%. Cloud transformation remained a high priority area for By geographic markets, North America grew 24.2%, UK grew enterprises in FY 2023, with greater focus on execution. They 11.4% and Continental Europe grew 9.2%. Among emerging engaged us to take up the modernization and migration of markets, Latin America grew 24.8%, India grew 14.9%, Middle their bigger, more complex workloads. The breadth and depth East & Africa grew 12.5% while Asia Pacific grew 7.1%. of our cloud expertise, our scale, deep domain knowledge, strong partnership credentials with the hyperscalers and our The Board has recommended a final dividend of 24 per portfolio of intellectual property on the cloud, give us a distinct share, bringing the total dividend for the year to 115 per competitive edge in this phase of the cloud adoption cycle. share. For the full year, the company s shareholder payout was 42,079 crore, 108.2% of the free cash flow during the year. We also helped clients cope with the challenge of managing cloud expenses. In some cases, it required rearchitecting Innovate, Adapt, Thrive their application stack to be more cloud native, capable of Our performance this year reflects how much of an enterprise dynamically ramping up resource consumption during periods staple IT services have become. Our full services capability of high demand, and automatic ramping down at other times. enables us to help our clients thrive, in good times and bad. Elsewhere, we offered our FinOps advisory and cloud managed During the up-cycle, we help clients accelerate and expand services to rein in cloud costs. their technology-led innovation to differentiate themselves and drive growth. On the down cycle, we help them adapt, using The adoption of cloud technologies continues to drive innovation within enterprises. The availability of compute, data 1 GRI 2-22 Letter to Shareholders 8 and networks at scale provides access to powerful technologies Newer developments like generative like advanced analytics and machine learning, applied to diverse AI, large language models, and areas like computer vision, text and speech processing, in quantum computing triggered more domains like dynamic supply chain optimization, new molecule experimentation and innovation discovery in life sciences and usage-based pricing of insurance coverage. by our clients. Our investments in research and innovation across Newer developments like generative AI, large language models, different industries, and our Pace and quantum computing triggered more experimentation and innovation by our clients. Our investments in research and innovation architecture have innovation across different industries, and our Pace innovation positioned us well to partner with architecture have positioned us well to partner with them in them in these initiatives. these initiatives. Our Agile Innovation Cloud offering, where we create dedicated, location-independent innovation teams to help clients accelerate and scale up their innovation, gained further traction in FY 2023. 7 new clients signed up during the year, bringing the total to 30 clients. Some of the emerging innovation themes that we helped Applied at scale, across a broad set of business or IT customers with include ecosystem and multi-industry models operations, this can result in an entirely new operating underpinned by technologies like data marketplaces, API and model that significantly boosts our clients competitiveness. blockchain, in industries like transportation and public sector; As macroeconomic uncertainty increased in the second half AI-powered autonomous robotics in the logistics industry, and of the year, we saw clients adapting by reprioritizing their new applications for digital twins in the BFSI, Telecom and Retail spends and showing greater interest in such operating model industries. transformations. Within our growth and transformation (G&T) portfolio, business TCS CognixTM, our AI-driven human machine collaboration suite, model innovation continued to be a key theme. For example, has been a game changer, enabling faster transformations for a large Fortune 500 electric gas utility, we built the service that deliver concrete business benefits within months. Its 600 delivery platform central to their new business model of pre-built configurable and reusable digital solutions enable plug providing warranty repair, refurbishment and replacement and play transformation of a range of business and technology services of various home appliances to households. functions, horizontal and vertical. Nearly 300 of our clients have used it to transform their business and IT operations. Ingram Micro, one of the largest technology distributors in the US, engaged us as a partner to power their pivot into In traditional outsourcing deals, we saw more multi-services e-commerce and achieve their mission to transform from integrated deals. By consolidating multiple elements of the a traditional distributor to a platform company that does operation stack processes, applications, and the underlying distribution. Tapestry Inc, a leading New York-based house technology and infrastructure with a single strategic partner, of iconic accessories and lifestyle brands such as Coach, Kate clients not only achieve greater accountability, but also reduce Spade, & Stuart Weitzman, partnered with TCS to drive their complexity and derisk their larger business transformations. The omnichannel modernization and transform the customer same rationale is driving more vendor consolidation initiatives journey experience. that favor a few strategic partners with end-to-end service offerings, the right innovation capabilities and scale. Other G&T themes, such as M&A and sustainability continued to bring in high-profile deal wins and new strategic engagements All these trends play to our strengths. Our scale, structure, and for us in FY 2023. Elsewhere in this report, you can read about ability to bring together different capabilities into a seamless the work we did for Philips Domestic Appliances in its journey service delivery team, helped us win several large deals to be a standalone company, and how we helped Eversource throughout the year. Energy pursue its carbon neutrality aspirations. Investing in People Digital transformation, which began in the front office, towards enhancing customer experience, made further inroads within The supplyside challenges of the last two years peaked in the enterprise during the year, unlocking tremendous value the first half of FY 2023, with employee churn reaching in the middle and back office. As critical technologies such as unprecedented levels. We broke out of the vicious cycle of hiring machine vision and conversational systems get better with and counter-hiring within the industry by investing in onboarding the use of AI, our Machine FirstTM approach is helping clients an unprecedent number of fresh engineers over 110,000 in use them innovatively in the back office, embedding them FY 2022 and over 44,000 in FY 2023 and training them on the into reimagined processes to drive greater velocity, agility, technologies most in demand. throughput and resilience which, among other things, also enhances customer experience. Letter to Shareholders 9 In FY 2023, we focused on utilizing the spare capacity built up in So long, farewell the prior year, and recalibrated our hiring especially as attrition This year marks a key milestone in my journey with TCS, and started falling in the second half of the year. Our LTM attrition in an important transition point for the company, as I step down IT services for the year was 20.1%. Net addition in FY 2023 was from my role as CEO and MD on 31st May 2023. It has been an 22,600, and the closing headcount was 614,795. Our workforce absolute privilege and an unparalleled learning experience to continued to be very diverse, with over 150 nationalities lead our company in the last six years, a period of tremendous represented and with women making up 35.7% of the employee growth and transformation for us. base. On a more personal note, I am grateful to Chandra, our Our investments in organic talent development continue to Chairman, for his mentorship and backing over the years, to our deliver exceptional outcomes. In FY 2023, TCSers logged Board members for their guidance, and to all our customers 48.3 million learning hours, and acquired nearly 6 million for the confidence they reposed in us. I take this opportunity competencies. Popular technologies witnessed unprecedented to thank all my colleagues whose support and trust made levels of interest from our employees. During the year, 53,000 my journey as CEO successful, satisfying and unforgettable. I TCSers acquired certification on hyperscaler cloud skills, bringing also thank all my fellow TCSers whose energy, dedication and the total number to over 110,000, making TCS one of the Top 2 aspirations continue to power the organization s success. partners to the largest cloud providers. I have had the pleasure of interacting with some of you in Caring for Communities person over the last decade. Your feedback and insights helped We continued to work with communities across the world, me learn and shaped my worldview. Thank you for all your pursuing our long-standing commitment to programs in the support and encouragement. areas of skills development, bridging of digital divides and STEM education. In FY 2023, we estimate that our community With enterprises relying on technology ever more to drive their initiatives touched the lives of over 4.5 million beneficiaries competitive differentiation, technology intensity is rising and women, youth and members of marginalized communities. on a secular basis, the share of IT services within overall tech spending is also going up. I am confident that TCS best years are Our large programs in India around literacy, digital ahead, and I look forward to watching the company s continued entrepreneurship and youth skilling continued to gain scale. success from outside. Likewise, our STEM initiatives outside India. goIT is shaping the next generation of digital innovators in 42 countries, while Best Regards, Ignite my Future in School program has doubled its original Rajesh Gopinathan goal, serving over 2 million students and educators in five Chief Executive Officer and Managing Director geographies worldwide since inception in 2017. (For FY 2022-23) Our employee volunteer program called HOPE (Hours of Purpose by Employees) resulted in over 2.8 million hours of volunteering effort towards promoting issues most relevant in their local communities, such as mental health, climate action, circularity, education, skilling, mentoring, and conservation. On the environmental front, we continue to make good progress in our net zero journey. We have brought down our absolute carbon footprint across Scope 1 and Scope 2 emissions by 71% over base year 2016, meeting our target two years ahead of time. This was despite increased electricity consumption in FY 2023 from employees return to office. In addition to enterprise- wide initiatives for energy efficiency, we have also significantly increased our use of renewable energy. Renewable energy sources today make up 55% of the total (7.25% in 2016). Letter to Shareholders 10 Letter from the As part of their continuing digital transformation journey, we see sustained focus on cloud adoption, data architecture, customer CEO experience and business model transformation. Through these initiatives, our customers intend to avoid technology obsolescence, become an intelligent enterprise, introduce new Dear Shareholder, products and services, orchestrate ecosystems and provide immersive, hyper-personalized experiences. In addition, all our I am truly humbled by this opportunity to lead this remarkable customers have also committed to ambitious net-zero carbon organization that I have been part of for 34 years. The culture, emission targets. values and ethos of TCS and the Tata group have been an inspiration always. Your company has a very strong leadership On top of these current focus areas, technologies like 5G, IoT, team and a workforce that is highly motivated. It is my privilege generative AI, virtual reality / metaverse, digital twin and others to lead this talented team. are also gaining attention and are likely to attract investments in the short to medium term. As part of the transition, I interacted with a number of our customers, leadership teams and employees. This has further As technology adoption will remain a key driver of business enriched my understanding of the depth of our customer growth and transformation for our clients, we have been relationships, customers priorities and the opportunities relentlessly focussed on our clients needs and have been ahead of us. I see a huge potential to create positive impact for investing in building newer capabilities to help them accelerate our clients, our employees and for the broader community of technology adoption. Your company continues to focus on stakeholders that we serve. enhancing the talent base of its associates, building partnerships with key technology providers, expanding the innovation ecosystem and building its own products and platforms. These business and technology trends drove a strong deal flow throughout FY 2023, peaking in the fourth quarter. We closed the year with an order book of $34.1 Bn. This along with the strong pipeline replenishment gives us a good visibility for the medium term. I would like to take this opportunity to thank you for your continued support in this exciting journey ahead. Best Regards, K Krithivasan Chief Executive Officer and Managing Director Letter from the CEO 11 The Year Gone by Named to FORTUNE magazine s list of the World s Most Admired Companies, regarded as a barometer of corporate reputation. Evaluation criteria include innovation, social responsibility, quality of management, After a stellar 22-year career at TCS and global competitiveness, talent management, and quality a successful stint as Managing Director of products/services. Q4 and CEO from 2017 to 2023, Rajesh Gopinathan decided to step down from his role, and resign from TCS effective September 15, 2023, to pursue other interests. The Board nominated K Krithivasan to step into the role with effect from June 1, 2023. Ranked the number one IT service provider for customer satisfaction in Europe in an independent survey of over 1,800 CXOs by Whitelane Research. This is the tenth consecutive year that TCS has received the top ranking in this survey. Of the top 23 IT service providers ranked on customer satisfaction, TCS topped the list, scoring 83%, versus the group s average of 75%. Announced an expansion of its long-standing partnership with Phoenix Group, UK s largest long-term savings and retirements provider, to digitally transform the latter s ReAssure business using the TCS BaNCSTM based digital platform, and to administer the insurer s 3 million policies. Consolidating on TCS platform will help Phoenix Group drive synergies and enhance customer experience. Named to the Forbes list of America s Best Large Employers, based on a large, independent survey of US employees. TCS was Announced a special dividend of 67 per share, along with also recognized as a Global Top Employer for the eighth year three interim dividends of 8 each. This, along with the final in a row, and as Top Employer in North America, Europe, Asia dividend of 24, amounted to a total dividend of 115 per share. Pacific, and Latin America. The total shareholder payout for the year was 42,079 crore. Rated Baa1 by Moody s credit rating agency, reflecting Selected as a strategic partner by Bombardier, a global moderate credit risk for entities in the investment grade leader in aviation, to drive its organization-wide IT and digital",
    "overall_tone": null,
    "extracted_at": "2025-08-02T21:16:40.065149"
  },
  {
    "company_name": "Bharti-Airtel",
    "year": "2024",
    "sector": "IT",
    "source_url": "https://www.bseindia.com/stockinfo/AnnPdfOpen.aspx?Pname=c2194c0b-bec7-42ba-9675-afdf7a9e7e9c.pdf",
    "mda_text": "details, please refer to the Management Discussion and Analysis (MDA) section of this report. To reduce absolute Scope 3 GHG emissions by 42% by FY ending 2031, Reported 6,698,692 tCO e of carbon P2 and P6 2 using FY 2020-21 as baseline, per SBTi emissions (Scope 3) in FY 2024-25 In line with target set by GSMA under Carbon Action Plan for telecom We plan to get the long-term (net zero) industry, achieve net zero carbon emissions by 2050 targets validated by SBTi within 2 years Resource efficiency Oversees the Company's priorities in environmental, social Board of Directors and governance (ESG), as well as the long-term strategy for Ensuring e-waste is sold to authorised recyclers/refurbishers to ensure E-waste is sold to authorised recyclers/ P2 and P6 sustainability, targets and performance environmentally sound waste management refurbishers Sustaining ISO 14001 certification (for environment management system)3 Successfully completed surveillance audit P6 Provides strategic guidance and decision-making on ESG and is responsible for review and approval of ESG strategy, Digital Inclusion goals and targets The Company is committed to positively impact 150 million lives by 2025 Enabled 4G/5G network connections P8 by promoting digital inclusivity through extending high-speed 4G/5G data and covered an additional population of Identifies key ESG initiatives and establishes procedures, connectivity to data-starved regions and accelerating upgradation of feature 158 million between January 2021 and systems, oversight mechanisms and standardised protocols phone users to smartphones, making device ownership affordable for low- March 2025 to attain the outlined ESG objectives income groups Develops the ESG roadmap and monitors performance on Diversity, Inclusion, Equity and Belonging initiatives as well as mapping and reporting of ESG progress in line with national and global frameworks Ensuring at least 20% women employees by FY ending March 2025 18.5% women employees in workforce P3 and P5 as on March 31, 2025 Implement sustainability action plan on ground and are Employee Health and Well-being responsible for the execution and monitoring of ESG initiatives associated with their function Sustaining ISO 45001 certification (for occupational health and safety Successfully completed surveillance audit P3 and P5 management system)3 Risk Management Committee Community Stewardship2 Reviews strategic risks and opportunities, including climate change To contribute 2% of the average net profit of the preceding three financial C486.82 Mn contributed to CSR and P8 years, in CSR and social development activities each year charitable activities in FY 2024-25 (please refer Annual Report on CSR activities at page 62 for more details) Enhancing Customer Experience and Satisfaction To reduce B2C customer interactions by 20% by FY ending March 2025, 17% reduction in overall B2C customer P9 using FY ended March 2023 as baseline interactions from FY 2022-23 Maintain compliance with EMF radiation levels set by local regulations in line No non-compliances were observed for P9 with ICNIRP Standards (International Commission on Non-Ionising Radiation all the base stations audited by DoT in Protection)3 FY 2024-25 Data Protection and Cybersecurity Maintain zero data breaches Airtel has zero cases for data breaches P9 in FY 2024-25 Human Capital Development To increase average training hours per employee by 15% 29 training hours per employee, against P3 a target of 17 hours per employee Sustainable Supply Chain Management Implement an ESG engagement programme with 75% of suppliers Implemented ESG engagement P2 and P8 (based on expenditure value) by 20253 programme with 75% of suppliers Corporate Governance Periodically conduct materiality assessment through formal stakeholder Revisited materiality assessment to P1 and P4 engagement to prioritise ESG focus areas ensure continued applicability 1 NGRBC stands for National Guidelines on Responsible Business Conduct principles. For more details, refer to the BRSR on page 194. 2 The coverage of targets is only standalone Bharti Airtel Limited (BAL). 3 The coverage of targets is Bharti Airtel Limited and Bharti Hexacom Limited. krowemarF tnemeganaM ksiR esirpretnE Bharti Airtel Limited Integrated Report and Annual Financial Statements 2024-25 Board ESG Committee ESG Council 01 Corporate Sustainability Function ESG Functional Champions (Representatives from all functions) 02 03 04 42 43 and Performance Overview Bharti Airtel Limited Integrated Report and Annual Financial Statements 2024-25 Our Approach to ESG Strengthening Our Sustainability Ethos We are committed to creating limitless impact by driving meaningful transformation through: Advancing Fostering responsible Enhancing ESG culture initiatives ESG disclosures 01 We undertook several ESG-focused initiatives to foster Showcasing Sustainability at India Mobile awareness and engagement among our workforce. Congress (IMC) These efforts sought to deepen understanding of We emphasised our commitment to sustainability environmental, social and governance principles while and responsible business practices at the prestigious empowering employees to contribute meaningfully to IMC 2024: our sustainability journey. Showcased case studies of impactful ESG initiatives Creating ESG Buzz focused on safety, green features of data centres and networks, circularity by utilisation of recycled To inspire and inform employees on ESG activities, we: plastic in SIM cards, dry waste incinerators, inclusion 02 ESG Commitments Shared climate related learnings, webinars and & diversity, social and green impact from schools run climate action apps, monthly newsletters by the Bharti Airtel Foundation Participated in Airtells 2024 an internal talent Participated in industry relevant panel discussions marketplace through ESG quiz and success shares 03 on circular economy, green digital practices, etc. Celebrated milestones like Earth Day with Participated in the launch of Report Towards Green employee participation United Nations Global Compact (UNGC) SBTi and Sustainable 6G in India as chair of the Green & Host an inhouse digital learning platform harbouring 04 Sustainability Working Group for Bharat 6G Alliance Building on our continued association with the United We have distinguished ourselves as a premier curated courses and expert webinars covering Nations Global Compact, our teams participated in the Indian telecom enterprise to align with global topics like energy efficiency, waste management, We remain steadfast in our commitment to advancing global SDG Innovation Accelerator program, joining 15 business leaders in adherence to the 1.5 C water conservation, green building concepts, our ESG initiatives. We have captured the responsible other Indian companies among 268 global corporate trajectory set by the Science Based Targets sustainable procurement, science-based targets, initiatives across focus areas through the performance participants. Our teams addressed key challenges like initiative (SBTi). gender equality and sustainability disclosure and outcomes presented in the subsequent sections of reducing carbon footprint and integrating circularity this report. Built capacity through learning programs by into supply chains, to developing technology-driven GSMA, UNGC along with facilitated sessions by sustainability solutions. sustainability experts Initiated an employee sustainability volunteer programme for continuous learning & contribution to sustainability UN Energy Compact GSMA ESG Metrics We have adopted the Energy Compact that aims Our early adoption of the GSMA ESG Metrics to mitigate the impacts of climate change. framework has helped us to benchmark against global sectoral peers across the key metrics covering environment, digital inclusion, digital integrity and responsible procurement. 44 45 and Performance Overview Bharti Airtel Limited Integrated Report and Annual Financial Statements 2024-25 Risk and Mitigation Framework Staying Ahead in an Top Risks Unpredictable Landscape 01 Regulatory and political uncertainties 06 Gaps in prevention of Data Loss Operating in diverse and often volatile markets across Asia and Africa, 02 Economic uncertainties 07 Increase in cost structures ahead of Airtel faces multifaceted risks stemming from political instability, revenues thereby impacting liquidity economic fluctuations and regulatory unpredictability. The rapidly Inability to provide high-quality network Poor Quality of networks and IT, including evolving technology landscape, intense competition, climate-related 03 08 experience with exponential growth in redundancies and disaster recoveries data demand disruptions and increasing data privacy obligations add to the complexities that further compound these challenges. This necessitates 04 09 Lack of digitisation and innovations Fiercely competitive battleground a proactive approach to identifying, assessing and mitigating multiple risks to ensure long-term sustainability. 05 Gaps in internal controls 10 Climate change and energy management 01 Responsibility and Accountability The Board of Directors Airtel s Management Operational Teams Regulatory and Political Uncertainties (Legal and Compliance) The Board of Directors, the apex body, The CEOs of Airtel s businesses in The Executive Committees (EC) of reviews critical risks and approves India and Africa (AMB and Africa Circles in India and international Outlook from last year Emerging risk mitigation plans. Along with Exco) manage the strategic risks that operations manage risks at the the Risk Management Committee may impact their operations. These ground level, with local representation (RMC), the Board conducts an annual risks are identified by Circle teams, from all functions central (Finance, Capitals Impacted Material Issues for Airtel evaluation of Airtel s risk management the national leadership and teams Supply Chain, Legal & Regulatory) and framework. The RMC carries out from the international operating customer-facing functions (Customer Regulatory compliance 02 periodic assessments, formulates companies. The management also Service, Sales & Distribution and Corporate governance & business ethics the risk management policy and uses internal audit reports to identify Networks). The Circle CEO or Country monitors its implementation. The risks and monitors internal and MD engages with functional leaders Chief Risk Officer, working closely with external environments to detect and partners to manage and identify 03 Context the RMC, independently reviews risk potential material risks. risks, escalating them to the central assessments and related action plans. teams for mitigation planning. Airtel operates in India and 14 African countries, with maintaining neutral relationship with the government and presence in Bangladesh and Sri Lanka. Some of these government authorities, such as the Telecom Regulatory 04 countries (or regions within countries) are prone to political Authority of India (TRAI), Universal Service Obligation Risk Identification and Management Process instability, civil unrest, pandemic and social tension. (USO) Fund, Municipal Pollution Control Boards and Besides, the political systems in a few countries are fragile, other stakeholders. Through its CSR initiatives (Bharti resulting in regime uncertainties and hence, the risk of Airtel Foundation, etc.), the Company contributes to the arbitrary actions. socio-economic development of communities, especially Environmental Risk Measurement Accountability Action Plan in the field of education. Scanning Classification Methodology Assignment Development Impact Assess internal and Categorise risks Establish objective Assign responsibilities Define detailed Airtel also actively works with industry bodies such external business by probability, methods to assess to individuals and mitigation plans Regulatory uncertainties and changes, such as escalating as the Cellular Operators Association of India (COAI), environments for impact and nature identified risks roles to implement for key risks spectrum prices, subscriber verification norms and Confederation of Indian Industry (CII), Associated potential risks mitigation plans penalties and changes in Standing Advisory Committee Chambers of Commerce of India (ASSOCHAM), Global on Radio Frequency Allocation (SACFA) norms and System for Mobile Communications Association (GSMA), Electromagnetic Field (EMF) radiation, etc. are potential Internet Service Providers Association of India (ISPAI) and risks faced by the Company. Federation of Indian Chambers of Commerce & Industry Risk Resource Performance Governance Reporting (FICCI) to voice industry concerns such as penalties, Prioritisation Allocation Monitoring Regularly report progress and exposures Mitigating Actions right of way, tower sealing, among others. The Company List and prioritise key Approve necessary Review action plan to the Board and the Audit/Risk risks for focused resources and progress, assess gross Management Committees Airtel engages proactively with key stakeholders in the maintains a strict oversight on compliance with applicable management budgets for and net exposures and countries in which it operates, continuously assessing regulations and byelaws, ensuring its operations are within Escalate specific issues directly to the Audit/",
    "overall_tone": null,
    "extracted_at": "2025-08-02T21:40:12.481059"
  },
  {
    "company_name": "Bharti-Airtel",
    "year": "2023",
    "sector": "IT",
    "source_url": "https://www.bseindia.com/stockinfo/AnnPdfOpen.aspx?Pname=\\c47b5c5b-4b08-48c3-801f-3be3d4646981.pdf",
    "mda_text": "Risk and Mitigation Framework 52 Management Discussion & Analysis 120 Statutory Reports 146 Financial Statements 240 Corporate Overview Management Discussion & Analysis Statutory Reports Financial Statements About the Report This Report adheres to the Integrated Reporting framework and presents Our Stakeholders our financial and non-financial performance. It contains key quantitative and qualitative disclosures on our relationships with the stakeholders, and how Customers Investors Suppliers Employees our strategies are aligned to deliver long-term value, while managing risks and changes to the external environment, for all our stakeholders. Channel Partners Network Partners Regulatory Bodies Community/NGOs Reporting period Data integrity This Report is for the period between April 1, 2022 We collected and analysed relevant data captured through and March 31, 2023, and is released annually. The last our integrated data management system applying Integrated Report was released for FY 2021-22. stringent internal controls to support our disclosures for this Report. Our aim is to provide information that is Reporting boundary Our Capitals accurate and reliable, and at the same time unbiased, This Report covers information on business operations of comparable, and comprehensible. Wherever applicable, Bharti Airtel Limited, aptly disclosed through six capitals as we have taken care to cite any significant limitations in the Financial Manufactured Intellectual defined by the International Integrated Reporting Council information provided. (IIRC, now consolidated into IFRS Foundation). All the six Assurance capitals (except financial capital) cover information on India operations excluding Airtel Payments Bank Limited, unless To ensure the integrity of facts and information, the Social Human Natural specified otherwise. The parameters for financial capital Board of Directors and management have reviewed the and Relationship covered in this report are in relation to Bharti Airtel Limited Integrated Report and BDO India LLP has carried out on a standalone basis. This report considers the primary independent assurance on sustainability disclosures reporting period as April 1, 2022 to March 31, 2023. presented in this report. The Independent Assurance However, some sections of this Report represent facts Statement issued by BDO India LLP forms a part of this and figures of previous years to provide a comprehensive Report. The statutory auditors, Deloitte Haskins & Sells view to the stakeholders. LLP, Chartered Accountants have provided assurance on",
    "overall_tone": null,
    "extracted_at": "2025-08-02T21:41:14.471793"
  },
  {
    "company_name": "Kotak-Mahindra-Bank",
    "year": "2024",
    "sector": "IT",
    "source_url": "https://www.kotak.com/content/dam/Kotak/investor-relation/Financial-Result/Annual-Reports/FY-2024/kotak-mahindra-bank/Error-Clarification-Integrated-Annual-Report-2023-24.pdf",
    "mda_text": "Stakeholder Engagement and 42 Management s Discussion and Analysis 343 Materiality Assessment Business Responsibility and Sustainability Report 386 Risk Management 46 (BRSR) Governance 52 Annexures ESG Data Tables 422 GRI Index 428 TCFD Index 430 Assurance Statements 431 Page 08 Message from Ashok Vaswani Managing Director & CEO 04 About Us Purpose-led, value-driven Established in 1985, Kotak is one of India s leading diversified and integrated financial services conglomerates, providing a wide range of financial solutions across customer and geographic segments within India. As a Group, Kotak also operates in overseas markets through international subsidiaries and branches in key geographies.1 Kotak has been built on the ethos of trust, governance, prudent risk management practices, product expertise, innovation in its offerings and a talented management team with an entrepreneurial mindset. This conflux of elements has resulted in the creation of the robust financial conglomerate structure that it is today. All this we have done, keeping in mind, the long-term interest of our stakeholders for sustainable growth. We are uniquely positioned to serve our customers across every spectrum of their financials needs. J J Kotak is a 7.7 trillion institution with a market capitalisation of 3.5 trillion as on 31st March, 2024 Unleashing the Power of Kotak s Financial Conglomerate Structure Kotak Mahindra Bank Limited- Parent Company Banking and Capital Asset Other Lending Protection Markets Management related entities Banking, Private Banking, Asset Broking and Investment Life and General Insurance Asset Management, Alternate Reconstruction, Car Finance and Banking Assets and Pension Fund Microcredit among others All subsidiaries are 100% owned beneficially by the Bank Kotak Universe J J J 7,67,667 cr 5,60,140 cr 4,45,269 cr Total assets Assets under management Total deposits J J J 4,30,352 cr 1,75,302 cr 7,80,320 cr Total advances Total investments# Relationship Value$ 5.0 cr 6,81,000 1,16,000 Number of customers of the Bank Shareholder base Full-time employees Consolidated Assets as on 31st March, 2024 All numbers are on a consolidated basis except where stated #Excludes Policyholders Investments $Relationship Value of Private Banking Priority Investment Advisory 1GRI 2-1 Integrated Annual Report 2023-24 05 Who We Are About Us Building unified user interactions across various platforms Our strategy of creating a seamless customer experience between physical, voice and digital channels remains unchanged. At Kotak, we are actively participating in India s digital revolution and relentlessly working to improve the digital banking experience for our customers. Our services are available on various digital channels, such as websites, mobile apps, WhatsApp, chatbots, voice bots and kiosks. To provide ease of access, information and short videos are made available in English, Hindi and other vernacular languages. Bots are deployed to automate services, go paperless and deliver customer responses faster. Digital universe 3.4 cr 59.5 lakh 68% 98% Debit cards in force Credit cards in force Growth in transaction volume Savings account transactions on mobile app through digital or non-branch modes in FY 2023-24 Physical Footprint Our pan-India distribution network comprising branches and Group Branch Network In India franchisees enables us to reach out to a large customer base. We also have an international banking unit in Gujarat International Finance Tec-City (GIFT City), a Bank branch in the Dubai International Financial Centre (DIFC) and international offices in New York, 151 1,196# 292 London, Mauritius, Dubai, Singapore and Abu Dhabi. 1,948 3,291 Bank branches Bank ATMs 31 101 855 898 5,137 Bank Pan-India operating Group branch network locations in India # 563 Bank branch distribution (No. I %) Bank branch classification (No. I %) East 164 8% Metro 887 45% North 603 31% Rural 326 17% South 577 30% Semi Urban 309 16% West 604 31% Urban 426 22% YoY Does not include branches in GIFT City (Gujarat) and DIFC (Dubai) Including cash recyclers #Kotak Securities network includes branches, franchises and referral co-ordinators 06 07 Who We Are Board of Directors Board of Directors Guardians of your trust Left to Right Ashok Gulati Uday Shankar Uday Khanna Ketaki Bhagwati Eli Leenaars Amit Desai Independent Director Independent Director Independent Director Independent Director Independent Director Non-Executive Director Left to Right Shanti Ekambaram Ashok Vaswani C S Rajan Uday Kotak Ashu Suyash Deputy Managing Director Managing Director & CEO Non-Executive Independent Non-Executive Director Independent Director Part-time Chairman Integrated Annual Report 2023-24 08 Message from Ashok Vaswani Transforming for scale In all my 35 years of working experience, one lesson stands out: if you get it right by the customer, everything else will fall into place. If you don t get it right by the customer, then nothing else matters. At Kotak, we are deeply determined to get it right by our customers. Ashok Vaswani Managing Director & CEO Integrated Annual Report 2023-24 09 Year in Review Message from Ashok Vaswani Dear Shareholders, It is with a great sense of humility, excitement and determination that This is also what drives my determination. I share my first thoughts with you. I am deeply committed to ensuring that our key stakeholders are Kotak is one of the largest financial conglomerates in India, with a proud of the Kotak Group and the Group achieves its rightful position stellar reputation, a strong brand, global standards of governance, a in the financial services industry. That then brings me to our core prudent risk management mindset, and a dedicated management strategy for the next phase team. Therefore, it is no surprise that Kotak has delivered excellent financial results, growing consolidated Profit After Tax at a 5-year Transforming for scale CAGR of 20.4% fiscal year 2023-24 being no exception. Equally important while transforming for scale would be to Scale for Relevance and not for the sake of size. The credit goes to Uday Kotak, who has built this exceptional business, directed its growth from a bill discounting business to the most diverse financial organisation in the country today. His incredible attention to detail and to first principles have been pivotal in navigating difficult situations over the last few decades, such as the NBFC crisis, global financial meltdown, COVID-19 pandemic, etc. Customers Company Colleagues Community Uday s ability to build a strong management team that embodies entrepreneurial energy has been instrumental in our success over these years. Words cannot sufficiently express the institutional building that he has achieved. And this is exactly what we want to sustain a preeminent institution that outlives generations! I am humbled and grateful that I have been chosen to lead our Customers company into its next phase of growth. I sincerely believe that we are The Heart of Our Business extremely well poised to take this franchise to the next level. In a way, The most important stakeholder is our Customer. In all my 35 years I have trained for 35 years across every geography in the world to of working experience, one lesson stands out: if you get it right by take on this opportunity. the customer, everything else will fall into place. If you don t get it right by the customer, then nothing else matters. At Kotak, we are Of course, the Indian economy and the Indian drive and determination deeply determined to get it right by our customers by understanding are clear tailwinds. India s growth trajectory, both in terms of stature their needs and building appropriate propositions and thus being the and prominence, achieved on its own terms, is truly inspiring. Over right partner to them which sometimes may even mean saying no. the years, I have seen this first hand while managing businesses The good news is that we have a comprehensive range of products in India from abroad. As an Indian, my heart swelled with pride and services within Kotak, enabling us to fulfil our promises. We regardless of the geography that I was in. This, coupled with all the assure our customers that we will make it easier for them to do internal building blocks that we have, gives me a great sense of business with us. excitement and energy as we take this institution to the next level. Every single financial product and service that we provide is a means to an end rather than the end in itself. Hence, making sure that we are there and deliver for the customer on their terms becomes critical. Getting this right will lead to our customers Kotak is one of the largest financial conglomerates in rewarding us with their loyalty and business. In turn, this approach India, with a stellar reputation, a strong brand, global will help us scale our business and expand market share. Where standards of governance, a prudent risk management we already have a good market share, we will aim to maintain mindset, and a dedicated management team. our position while simultaneously driving growth in other Therefore, it is no surprise that Kotak has delivered business segments. excellent financial results, growing consolidated Profit After Tax at a 5-year CAGR of 20.4% fiscal year 2023- 24 being no exception. Every single financial product and service that we provide is a means to an end rather than the end in itself. Hence, making sure that we are there and deliver for the customer on their terms becomes critical. 10 Message from Ashok Vaswani Company Colleagues Building Sustainable Value Our Greatest Asset You give us the capital to run our Company, and it is our We can only achieve our goals through our greatest asset and commitment to deliver to you to build a great company that you ambassadors our Colleagues. Committed colleagues who are can be proud of and an institution that delivers sustainable and aligned with the Company s purpose will deliver for the customer. consistent financial returns. The job of everyone in the Company is to become a customer facing colleague, or at the very least, serve the front-line colleague On a consolidated basis in FY 2023-24, our Net Profit grew at 22% facing the customer. We will transform our internal processes to YoY to 18,213 crore translating into a strong Return on Assets of make it easier for our customer-facing colleagues to meet the 2.66%. As on 31st March, 2024, our Networth was 129,892 crore, needs of the customer. Book Value per Share was 653 and Capital Adequacy Ratio stood at 21.8%. Total Assets Under Management was over 560,000 crore. Attracting and retaining colleagues who are excited about being customer obsessed will be our mantra as we transform for scale. At the Bank standalone level, our customer base grew to over 5 crore, Net Profit grew 26% YoY to 13,782 crore and Net Interest Margin stood at 5.32%. YoY we grew our deposits and advances by over 20% while maintaining credit cost at 45 bps. We will transform our internal processes to make We recognise that you have many options, but we will demonstrate, it easier for our customer-facing colleagues to as we have in the past, that we will deliver for you consistently. meet the needs of the customer. At this stage, it is appropriate to address the recent RBI order. Over the last few years, we had completely embraced the notion that leveraging technology is fundamental to growing the business. Towards this, we had significantly stepped up resources and investments in technology. However, it is evident that we have Community more to do. Changing customer expectations, the dramatic pace of business growth and the emerging risk landscape have meant Thriving Together that we have to move at a much faster pace. We are absolutely Another very important stakeholder is our Community. Within this, committed to further enhancing our resources and commitments in the most important stakeholders are our regulators. Our regulators this area and I am very confident that collectively, as a team we will give us the licence to do business. They essentially want us to take deliver and use this as an opportunity to leapfrog. care of our customers and do that in a prudent manner. That is exactly what the management team seeks to do. Hence, there is no It is also very clear that technology is going to be at the centre of our ray of light between the regulators and the team. efforts to transform and hence, scale. More broadly, we can only thrive if the community in which we live and operate thrives. It is in our self-interest to make sure that the community thrives. Our efforts in this regard will be reflected in the value of our brand. Changing customer expectations, the dramatic pace of business growth and the emerging risk landscape have meant that we have to move at a much faster pace. We are absolutely committed to further enhancing our resources and commitments in this area, and I am very Our regulators give us the licence to do business. They confident that collectively, as a team we will deliver essentially want us to take care of our customers and and use this as an opportunity to leapfrog. do that in a prudent manner. That s exactly what the management team seeks to do. Hence, there is no ray of light between the regulators and the team. Integrated Annual Report 2023-24 11 Year in Review Message from Ashok Vaswani As your management team, we will build a sustainable, high performing organisation. Our journey ahead is filled with opportunities and challenges, and I am confident that with your continued support, we will achieve our aspirations. We are determined to win and, more importantly, win in the right way! I am extremely proud of the CSR activity that we do as a Group, In conclusion, I want to leave you with one last thought as your especially on education, livelihood, healthcare and environmental management team, we will build a sustainable, high performing sustainability. Personally, I have benefited from my family s intense organisation. Our journey ahead is filled with opportunities and focus on education and sincerely believe in the adage of teach a challenges and I am confident that with your continued support, we person to fish and you feed them for life. Closely linked to that is will achieve our aspirations. We are determined to win and more the need to create employment and fuel entrepreneurship. That, in importantly, win in the right way! a sense, is Kotak s legacy, and we want to Transform for scale Entrepreneurship. I have been going around the country, meeting Let s keep going! many young people, and the confidence and sparkle in their eyes tell me that it is only the right thing to do. That s transforming and scaling the country, and as part of our community efforts, we will play our share. These are, no doubt, ambitious goals, but we are not playing for the Ashok Vaswani short term. Our commitment to you is to demonstrate consistent Managing Director & CEO progress against these goals. 6th July, 2024 12 13 Year in Review Value Creation Model Value Creation Model Perceiving value through the 4C framework Capitals employed Identified themes to drive value Value created for stakeholders K K Financial 4,48,954 cr 75,106 cr Strategic Themes Capital Deposits (Bank Standalone) Borrowings",
    "overall_tone": null,
    "extracted_at": "2025-08-02T21:41:41.223986"
  },
  {
    "company_name": "Kotak-Mahindra-Bank",
    "year": "2023",
    "sector": "IT",
    "source_url": "https://www.bseindia.com/stockinfo/AnnPdfOpen.aspx?Pname=\\b9e0c871-3353-4ef4-855e-069bcfd848e1.pdf",
    "mda_text": "Management s Discussion and Analysis 301 Business Responsibility and Sustainability Report (BRSR) 335 Sustainability at Kotak ANNEXURES Page 50 ESG Data Tables 364 GRI Index 372 TCFD Index 376 Assurance Statement 379 Supporting Communities Page 70 2 ABOUT US Driving Responsible Growth Embracing the winds of change, Kotak has emerged as a transformative force within India s financial landscape. Over the years, we have successfully navigated evolving market dynamics, consistently adapting offerings to meet the needs of a dynamic clientele. Powered by innovation and cutting-edge technology, we pioneer financial solutions, ushering in an era of convenience and empowerment. Further, we are embracing sustainability and ESG practices to drive transformative progress and create sustainable value for our stakeholders. Kotak is one of India s leading diversified and integrated financial services conglomerates, providing a wide range of financial solutions, covering banking (consumer, commercial and corporate), credit and financing, asset management, alternate assets, life and general insurance, stock broking, investment banking, private banking, microfinance and asset reconstruction across customer and geographic segments within India. As a Group, Kotak also operates in overseas markets through international subsidiaries and branches in key geographies. In line with our relentless focus on customers, technology and talent, the Bank is accelerating change, thus driving sustainable growth across businesses and customer segments. Kotak s consolidated asset base stood at 6.2 trillion as of 31st March, 2023, with a market capitalisation of 3.4 trillion.1 KOTAK UNIVERSE E E E 6,20,430 cr 4,20,880 cr 3,61,273 cr Total assets Assets under management Total deposits E 3,59,107 cr E 1,39,359 cr 5,82,000 Shareholders base Total advances Total investments 41.2 mn 1,00,000 Number of customers of the Bank Full-time employees All numbers are on a consolidated basis except wherever stated 1GRI 201-1 Excludes Policyholders investments Acceler@ting change 3 Who We Are Financial Highlights About Us",
    "overall_tone": null,
    "extracted_at": "2025-08-02T21:42:10.462843"
  }
]