[
  {
    "company_name": "TCS",
    "year": "2024",
    "sector": "IT & Software",
    "source_url": "https://www.tcs.com/content/dam/tcs/investor-relations/financial-statements/2023-24/ar/annual-report-2023-2024.pdf",
    "mda_text": "Management Discussion and Analysis................................ 69 Awards and Accolades......................................................... 91 Corporate Governance Report............................................ 93 Corporate Social Responsibility........................................... 117 Business Responsibility and Sustainability Report............... 127 Integrated Annual Report 2023-24 4 Board of Directors Board of Directors Non-Independent, Non Executive Independent, Non Executive N Chandrasekaran Aarthi O P Dr Pradeep Kumar Hanne Chairman Subramanian Bhatt Khosla Sorensen C C M N M N C M M I C M I M M I Non-Independent, Executive K Krithivasan N G Subramaniam Keki Al-Noor CEO & MD COO & ED Mistry Ramji C C M I M M I M M M NE M M NE 65 I Independent, Non-Executive Director Average Age (years) 57 73 NE Non-Independent, Executive Director N Non-Independent, Non-Executive Director Average Tenure on 07 the Board (years) 0 17 Board Committees C Chairman M Member Board Independence (%) Audit Committee Nomination and Remuneration Committee Stakeholders Relationship Corporate Social 56% 44% Committee Responsibility Committee Independent Non-Independent Executive Risk Management Committee Committee Average Tenure of Independent 06 Samir Seksaria (Chief Financial Officer), is also a member of the Committee Directors on the Board (years) 0 12 Integrated Annual Report 2023-24 Management Team 5 Management Team Corporate K Krithivasan Dr. Harrick Vin Chief Executive Officer and Managing Director Chief Technology Officer N G Subramaniam Abhinav Kumar Chief Operating Officer and Executive Director Chief Marketing Officer Samir Seksaria Madhav Anchan Chief Financial Officer General Counsel Legal Milind Lakkad Pradeep Manohar Gaitonde Chief Human Resources Officer Company Secretary Business Heads Industries Susheel Vasudevan Anupam Singhal Banking Financial Services and Insurance Manufacturing Shankar Narayanan V Rajanna Banking Financial Services and Insurance Technology, Software and Services Debashis Ghosh Akhilesh Tiwari Life Sciences, Healthcare, Energy, Resources and Utilities Communications, Media and Information Services Krishnan Ramanujam Consumer Business Group Markets Suresh Muthuswami Sapthagiri Chapalapalli Chairman TCS North America Europe Amit Bajaj Girish Ramachandran North America Growth Markets Amit Kapur UK & Ireland Services Siva Ganesan Ashok Pai AI.Cloud Enterprise Cognitive Business Operations Vikram Karakoti Regu Ayyaswamy Enterprise Solutions IOT & Digital Engineering Ganesa Subramanian Vaikuntam Kamal Bhadada Cyber Security TCS Interactive Integrated Annual Report 2023-24 6 Letter from the Chairman Across industries globally, there are multiple mega trends that are shaping priorities of businesses: AI, New Energy, Supply Chain and Talent. These transitions will require substantial investment in technology across industry sectors. Your company is making significant investments and building capabilities to partner with customers during this phase of rapid technological shifts. Letter from the Chairman Dear Shareholder, In FY 2024, your company has continued to deliver strong After two years of recessionary fears, persistently high performance. I am pleased to share with you that your company inflation, and unprecedented monetary tightening, the global has crossed annual revenues of ₹240,893 crore, a growth of macro-outlook looks relatively better now with improving 6.8%, over the previous year. With relentless focus on operational growth, disinflation, and monetary easing in sight. excellence, this growth has come at an industry leading operating Across industries globally, there are multiple mega trends that margin of 24.6% , an increase from 24.1% last year. The order are shaping priorities of businesses: AI, New Energy, Supply book for FY 2024 came at an all-time high of US$ 42.7 billion Chain and Talent. supported by strong client relationships and engagement. Client metrics continue to exhibit healthy progress with strong client GenAI technologies will impact almost every sector and additions. Employee retention continues to be at benchmark country going forward. Enterprises have already invested levels in the industry. TCS has been selected as a Top Employer of in cloud, data infrastructure and large processing power Choice in 32 countries. TCS has retained its ranking as the second which will aid AI/ GenAI. GenAI will not only improve most valuable global IT services brand, valued at US$19.2 billion, productivity, but also create impact we hitherto have not an increase of US$2 billion from last year. seen or imagined. The global environment around the world continues to go Global energy transition is accelerating, and businesses through significant shifts. Post the pandemic, which resulted in are making clear commitments towards a sustainable supply chain shocks, there was an economic slowdown especially future. The energy requirement of our fast-changing world in developed markets. While initial signs of stability began to is enormous. Key is to lower the cost of energy while also emerge, the military conflicts have further intensified this year transitioning to renewables. This transition requires large and continue to impact the global supply chains. investment in technology, electric mobility, renewable power, hydrogen and sustainable fuel. Excludes settlement of legal claim Integrated Annual Report 2023-24 Letter from the Chairman 7 Geo-political challenges are continuing to alter established These transitions will require substantial investment in supply chains and companies are rebalancing their supply technology across industry sectors. Your company is making chains to address both resilience and efficiency. New global significant investments and building capabilities to partner with supply chain ecosystems are being created, with India customers during this phase of rapid technological shifts: playing an important role in advanced manufacturing. In FY 2024, TCS has consolidated AI and Cloud expertise Advanced manufacturing, new technologies like AI, new with the creation of the AI.Cloud unit. In addition, each energy, data and business models are changing the future of the business groups are developing domain-specific of work and are compelling new skillsets to be built for the AI/GenAI offerings relevant to the industry value chain. future. Over 300,000 employees have been upskilled on GenAI technologies in FY 2024. TCS products and services are Secure networks have become a key necessity as data is the also being enhanced with AI capabilities. For example, TCS foundation for businesses of today. These networks power BaNCSTM is enriching its product portfolio with integrated everything from predictive analytics and AI to personalized AI/ML and GenAI capabilities; AI is also being embedded in customer experiences. As value of data increases, along Cybersecurity services to enable predictive capabilities. with concerns of privacy and protection, it has rightly become a focal point of security for all businesses. To partner with customers on their energy transition agenda, TCS is investing in research on green hydrogen, The key question is what these disruptions mean to the IT biofuels; developing digital platforms to help customers services industry and how your company is preparing for these? reduce Scope 1/2/3 emissions. Our proprietary ESG As enterprises globally prepare to respond to these mega framework enables enterprises to build transparency into trends, we see multiple opportunities for your company. Every operations and simplifies compliance reporting. industry is embracing these trends and their business is being shaped for the future. For example: TCS is pioneering the engineering of the 5G/6G communication stacks using open standards. Two The deployment of AI and GenAI will significantly help state-of-the-art labs for future ready communication financial institutions in both driving efficiency as well infrastructure and interoperability have been setup at as target new customers and serve customers in a very Bengaluru and Gurugram. Investments are being made in personalized manner. For example, Insurance claims multiple niche technologies such as 5G SA Core, O-RAN will be processed in a matter of minutes, lending and radios, to build these solutions indigenously. disbursements will become much faster. Your company continues to invest in upskilling its talent Adoption of new energy solutions and AI technology is base of over 600,000 employees. Employees are actively driving the future of automobiles. It is not only driving leveraging experiential and personalized learning on a wide reduction of emissions but also providing a new level of range of emerging technologies, clocking over 51 million customer experience. learning hours in FY 2024. TCS continues to build strong talent supply chains with deep partnerships with leading AI is accelerating drug development by screening millions educational institutions, shaping the curriculum for new of compounds, predicting interactions and generating new skill needs for the future. candidates for testing. On behalf of the Board of Directors of the company, I want to",
    "overall_tone": "",
    "text_length": 9234,
    "confidence_score": 0.72,
    "extraction_method": "direct_pdf_keyword_section",
    "extracted_at": "2025-08-02T22:18:33.736641"
  },
  {
    "company_name": "TCS",
    "year": "2023",
    "sector": "IT & Software",
    "source_url": "https://www.tcs.com/content/dam/tcs/investor-relations/financial-statements/2022-23/ar/annual-report-2022-2023.pdf",
    "mda_text": "Management Discussion and Analysis................................ 86 Awards and Accolades......................................................... 109 Corporate Governance Report............................................ 113 Corporate Social Responsibility........................................... 136 Business Responsibility and Sustainability Report............... 145 Content 3 Board of Directors Non-Independent, Non Executive Independent, Non Executive N Chandrasekaran Aarthi O P Bhatt Dr Pradeep Kumar Hanne Sorensen Chairman Subramanian Khosla C C M N M N C M M I C M I M M I Non-Independent, Executive K Krithivasan N G Subramaniam Keki Mistry Don Callahan CEO & MD COO & ED M M M NE M M NE C C M I M M I I Independent, Non-Executive Director 63 NE Non-Independent, Executive Director Average Age (years) 56 72 N Non-Independent, Non-Executive Director Board Committees C Chairman M Member Average Tenure on 07 the Board (years) 0 16 Audit Committee Nomination and Remuneration Committee Board Independence (%) Stakeholders Relationship Corporate Social Committee Responsibility Committee 56% 44% Independent Non-Independent Executive Risk Management Committee Committee Average Tenure of Independent 06 Samir Seksaria (Chief Financial Officer) is also a member of Directors on the Board (years) 04 11 the Committee Board of Directors 4 Management Team Corporate Business Heads K Krithivasan Susheel Vasudevan Chief Executive Officer Relationship Incubation Group and Managing Director Krishnan Ramanujam Enterprise Growth Group N G Subramaniam Chief Operating Officer Debashis Ghosh and Executive Director Business Transformation Group Samir Seksaria Suresh Muthuswami Chief Financial Officer Chairman TCS North America Milind Lakkad Amit Bajaj Chief Human Resources Officer North America Rajashree R Amit Kapur Chief Marketing Officer UK & Ireland K Ananth Krishnan Sapthagiri Chapalapalli Chief Technology Officer Europe Madhav Anchan General Counsel Legal Pradeep Manohar Gaitonde Company Secretary Management Team 5 Letter from the Chairman The global environment is going through considerable changes. At the same time, the world is navigating several important transitions: the Energy transition, the Supply Chain transition and the AI transition. Undoubtedly, these transitions will require significant investments in technology and innovation, and offer a huge growth opportunity for the IT industry. Letter from the Chairman 6 Dear Shareholder, a central focus. The impact of AI and Machine learning is going to be profound. There is a transition already underway from I am pleased to share that your company has done well in a predictive AI to generative AI. Majority of the businesses are volatile global environment in the year gone by. In FY 2023, still adopting predictive AI and are on the journey of capturing your company delivered revenue of ₹225,458 crore, a growth of large volume of data, harnessing the power of cloud and IoT. 17.6%. This growth has come at an industry-leading operating There are varying levels of adoption in companies across sectors. margin of 24.1%. Leveraging generative AI would further require technology innovation and investments. TCS continues to play a crucial role with clients to enable their business transformation, helping them accelerate new There is another important area that companies need to focus technology adoption and bring agility into execution. We work on building talent for the future. The energy, supply chain and with large enterprises on transformation initiatives to build a AI transitions are going to require companies to reskill/upskill digital foundation for the future, enable strategic leverage of existing talent base, hire and integrate new talent and invest data and artificial intelligence (AI) and reimagine customer and in research. Our technology strengths make us well-placed to employee experiences. respond to the global demand and scale up our talent base. Your company delivered healthy client metrics enabled by As the future of work is evolving, enterprises globally are also new customer additions and deep client relationships. assessing their approach to talent. Today, companies can tap In FY 2023, growth has come from broad-based performance into talent anywhere and leaders need to learn how to harness across markets and industry verticals. The order book continues the global talent pool effectively. Technology and tools are to be strong, indicating demand for your company s services. facilitating collaboration and enabling virtual and hybrid models From a talent perspective, the employee strength grew to over of work. Harnessing this talent will need an approach that 614,000 associates with 35.7% women associates. leverages technologies like AI and cloud to enable effective employee engagement and collaboration. The global environment is going through considerable changes. Geopolitical factors such as the conflict between Russia and Your company is significantly investing in building AI capabilities Ukraine, rising inflation and volatile commodity prices have which include products and platforms that are AI-powered. caused slowing down of global growth and created stress in the Over the last few years, your company has leveraged overall economic environment. partnerships to design and orchestrate a completely indigenous software-defined 4G/5G network stack. 5G technologies along At the same time, the world is navigating several transitions. with IoT, edge and AI will enable new digital transformation Undoubtedly, these transitions will require significant opportunities across industries, both industrial and consumer. investments in technology and innovation, and offer a huge We will also invest in research areas important for the future, growth opportunity for the IT industry. in collaboration with our global academic partners and start-up ecosystem. The global energy transition is accelerating. Businesses are making clear commitments towards a sustainable future. I would like to thank Rajesh Gopinathan for his contribution There are many innovations across products, services, during his tenure as CEO & MD and I wish him the very best for manufacturing, and delivery. New business models are also the future. I also take this opportunity to wish K Krithivasan the emerging. This requires investments in technology and very best in his new role as CEO & MD of your company. innovation including electric mobility, renewable power, hydrogen and sustainable fuel. In addition, sustainability On behalf of the Board of Directors of Tata Consultancy Services, compliance and reporting requirements are fast evolving as new I want to thank you for your continued trust, confidence, and standards and regulations are coming into play. Across the facets support. of this transition, investments in IT and digital technology will be an important enabler for businesses. Warm regards, N Chandrasekaran The supply chain transition resulting from the geo-political Chairman situation is altering the global supply chains. Companies are rebalancing their supply chains for resilience and efficiency. New global supply chain ecosystems are being created with India playing an important role. This is being led by significant capital investments in technology to set-up digital-first manufacturing and supply chain operations as well as to build ecosystem integration with partners. In the past decade, there has been a rapid evolution of digital technologies, bringing about a transformation across every industry. Now, the advancements in AI have made AI transition Letter from the Chairman 7 Our full services capability enables us to help our clients thrive, in good times and bad. During the up-cycle, we help clients accelerate and expand their technology-led innovation to differentiate themselves and drive growth. On the down cycle, we help them adapt, using technology to drive the efficiency, agility and resilience needed to cope with a faltering economy, and prepare for better times ahead. Letter to Shareholders1 Dear Stakeholder, Demand for our services showed remarkable resilience even as other parts of the technology universe deflated, and macroeconomic uncertainties worsened in our major",
    "overall_tone": "",
    "text_length": 8248,
    "confidence_score": 0.6100000000000001,
    "extraction_method": "direct_pdf_keyword_section",
    "extracted_at": "2025-08-02T22:18:50.851291"
  }
]