[
  {
    "company_name": "Tata Consultancy Services",
    "symbol": "TCS",
    "website": "https://www.tcs.com",
    "ir_url": "https://www.tcs.com/investors",
    "report_url": "https://www.tcs.com/investor-relations/events/tcs-thirtieth-agm",
    "report_title": "TCS’ 30th Annual General Meeting\n\n19 Jun 2025\n  Opens in new tab",
    "report_year": 2025,
    "report_type": "page",
    "mda_text": "Pathway’ in its STEM Education Program goIT 03 Jul 2025 TCS Unveils the 2025 Edition of TCS InQuizitive Across 12 Indian Cities, To Spotlight India’s Brightest Young Minds View all Media Kit Investor Relations Press tab for submenu items Tata Consultancy Services Limited NSE:TCS 3,003.00INR -33.80(1.11%) Discover more Q1FY26 Debrief Management Commentary Press tab for submenu items Latest Quarter Commentary Annual Report Section Financials Press tab for submenu items Quarterly Earnings Reports Download TCS Data Sheet Erstwhile CMC Financials News and Events Press tab for submenu items Press Releases Corporate Actions Events Calendar ESG Press tab for submenu items Environment Social Governance Policies and Reports Stakeholder Engagement and Enterprise Risk Management Resources Press tab for submenu items Investor FAQs eTDS Portal Stock Information Analyst Coverage Subsidiaries Subscribe to Investor Updates Unclaimed Dividend Information Worldwide Press tab for submenu items Global knowledge. Local support At TCS, we help enterprises grow through innovative solutions globally. Adapt and thrive with us. Discover more Global Press tab for submenu items Asia Pacific Australia and New Zealand Europe India Middle East and Africa North America United Kingdom Localized Press tab for submenu items China France Germany Japan Netherlands South Korea Sweden Click here or press enter to go to homepage Opens in new tab tata.com logoOpen in New Tab Search What we do Perpetually Adaptive Enterprise Press tab for submenu items Where adaptability meets advantage At TCS, we don’t just help businesses transform. We help them become perpetually adaptive enterprises, built to evolve continuously and confidently in a world of constant change. Adaptability starts here Industries Press tab for submenu items Banking Capital Markets Consumer Packaged Goods and Distribution Communications, Media, and Information Services Education Energy, Resources, and Utilities Healthcare High Tech Insurance Life Sciences Manufacturing Public Services Retail Travel and Logistics Services Press tab for submenu items Artificial Intelligence and Data & Analytics Cloud Cognitive Business Operations Consulting Cybersecurity Enterprise Solutions IoT and Digital Engineering Network Solutions and Services TCS Interactive Sustainability Services Products and Platforms Press tab for submenu items TCS ADD™ TCS BANCS™ TCS BFSI Platforms TCS CHROMA™ TCS Customer Intelligence & Insights™ TCS ERP on Cloud ignio™ TCS iON™ TCS HOBS™ TCS Intelligent Urban Exchange™ TCS OmniStore™ TCS Optumera™ TCS Tap™ Quartz™ – The Smart Ledgers™ TCS TwinX™ TCS MasterCraft™ Jile™ TCS DigiBOLT™ TCS AI WisdomNext™ Perpetually Adaptive Enterprise Industries expand here Banking Capital Markets Consumer Packaged Goods and Distribution Communications, Media, and Information Services Education Energy, Resources, and Utilities Healthcare High Tech Insurance Life Sciences Manufacturing Public Services Retail Travel and Logistics Services expand here Artificial Intelligence and Data & Analytics Cloud Cognitive Business Operations Consulting Cybersecurity Enterprise Solutions IoT and Digital Engineering Network Solutions and Services TCS Interactive Sustainability Services Products and Platforms expand here TCS ADD™ TCS BANCS™ TCS BFSI Platforms TCS CHROMA™ TCS Customer Intelligence & Insights™ TCS ERP on Cloud ignio™ TCS iON™ TCS HOBS™ TCS Intelligent Urban Exchange™ TCS OmniStore™ TCS Optumera™ TCS Tap™ Quartz™ – The Smart Ledgers™ TCS TwinX™ TCS MasterCraft™ Jile™ TCS DigiBOLT™ TCS AI WisdomNext™ Who we are Our Brand Press tab for submenu items With you for the long run Whether it’s running a marathon or helping businesses thrive in applying new technology innovations at scale, we understand what it takes to keep pushing the limits of what’s possible. Discover our brand About Us Press tab for submenu items Leadership Corporate Sustainability Diversity, Equity, and Inclusion Corporate Social Responsibility The TCS Way Alliances Research & Innovation Press tab for submenu items TCS Research TCS Pace™ Our Brand About Us expand here Leadership Corporate Sustainability Diversity, Equity, and Inclusion Corporate Social Responsibility The TCS Way Alliances Research & Innovation expand here TCS Research TCS Pace™ Insights Customer Stories Press tab for submenu items Discover why customers choose TCS We are a digital transformation and technology partner of choice for industry-leading organizations worldwide. Read our customer success stories. Events Press tab for submenu items Upcoming events 29 Sep 2025 TCS BaNCS at SIBOS 2025, Frankfurt 22 Sep 2025 TCS Life Sciences Forum 2025 London 03 Sep 2025 TCS at PostTrade 360°, Stockholm View all Analyst Recognition Press tab for submenu items Recent recognitions 01 Aug 2025 TCS a Leader in Experience-Led HR Transformation Services: NelsonHall 17 Jul 2025 TCS a Leader in Life and Annuities Insurance BPS and Third-Party Administrator Services: Everest Group 15 Jul 2025 TCS Recognized as a Leader in Healthcare Provider Digital Services by Everest Group View all Global Studies Customer Stories Events Analyst Recognition Global Studies Careers Build a future with us Press tab for submenu items Want to be a global change-maker? Join our team. At TCS, we believe exceptional work begins with hiring, celebrating and nurturing the best people — from all walks of life. Join us India Press tab for submenu items India Americas Press tab for submenu items Argentina Brazil Canada Chile Colombia Ecuador Mexico Peru Uruguay USA Asia Pacific Press tab for submenu items Australia Mainland China Hong Kong SAR Indonesia Japan Malaysia New Zealand Philippines Republic of Korea Singapore Chinese Taipei Thailand Europe and UK Press tab for submenu items Belgium Denmark Estonia Finland France Germany Hungary Ireland Italy Luxembourg Netherlands Norway Poland Portugal Spain Sweden Switzerland United Kingdom Middle East and Africa Press tab for submenu items Bahrain Israel Kuwait Qatar Saudi Arabia South Africa United Arab Emirates Build a future with us India expand here India Americas expand here Argentina Brazil Canada Chile Colombia Ecuador Mexico Peru Uruguay USA Asia Pacific expand here Australia Mainland China Hong Kong SAR Indonesia Japan Malaysia New Zealand Philippines Republic of Korea Singapore Chinese Taipei Thailand Europe and UK expand here Belgium Denmark Estonia Finland France Germany Hungary Ireland Italy Luxembourg Netherlands Norway Poland Portugal Spain Sweden Switzerland United Kingdom Middle East and Africa expand here Bahrain Israel Kuwait Qatar Saudi Arabia South Africa United Arab Emirates Newsroom Press Releases Press tab for submenu items Find the latest news about TCS Stay up-to-date on all press announcements by TCS Discover more News Alerts Press tab for submenu items Recent News 16 Jul 2025 TCS Launches AI-Powered Research & Innovation Centre in Singapore to Accelerate Enterprise Innovation at Scale 09 Jul 2025 TCS Launches ‘Gen AI Tech Pathway’ in its STEM Education Program goIT 03 Jul 2025 TCS Unveils the 2025 Edition of TCS InQuizitive Across 12 Indian Cities, To Spotlight India’s Brightest Young Minds View all Media Kit Press Releases News Alerts Media Kit Investors Investor Relations Press tab for submenu items Tata Consultancy Services Limited NSE:TCS 3,003.00INR -33.80(1.11%) Discover more Q1FY26 Debrief Management Commentary Press tab for submenu items Latest Quarter Commentary Annual Report Section Financials Press tab for submenu items Quarterly Earnings Reports Download TCS Data Sheet Erstwhile CMC Financials News and Events Press tab for submenu items Press Releases Corporate Actions Events Calendar ESG Press tab for submenu items Environment Social Governance Policies and Reports Stakeholder Engagement and Enterprise Risk Management Resources Press tab for submenu items Investor FAQs eTDS Portal Stock Information Analyst Coverage Subsidiaries Subscribe to Investor Updates Unclaimed Dividend Information Investor Relations Management Commentary expand here Latest Quarter Commentary Annual Report Section Financials expand here Quarterly Earnings Reports Download TCS Data Sheet Erstwhile CMC Financials News and Events expand here Press Releases Corporate Actions Events Calendar ESG expand here Environment Social Governance Policies and Reports Stakeholder Engagement and Enterprise Risk Management Resources expand here Investor FAQs eTDS Portal Stock Information Analyst Coverage Subsidiaries Subscribe to Investor Updates Unclaimed Dividend Information Worldwide Worldwide Press tab for submenu items Global knowledge. Local support At TCS, we help enterprises grow through innovative solutions globally. Adapt and thrive with us. Discover more Global Press tab for submenu items Asia Pacific Australia and New Zealand Europe India Middle East and Africa North America United Kingdom Localized Press tab for submenu items China France Germany Japan Netherlands South Korea Sweden Worldwide Global expand here Asia Pacific Australia and New Zealand Europe India Middle East and Africa North America United Kingdom Localized expand here China France Germany Japan Netherlands South Korea Sweden Contact us tata.com logo Opens in new tab Mute What are you looking for? Top Results Most Recent Most Recent Oldest first Showing 10 20 30 40 Previous 01 - 07 02 03 04 Next Investor Relations IR Key Events TCS' 30th Annual General Meeting June 19, 2025 Share TCS’ 30th Annual General Meeting Linkedin Opens in new tab X Opens in new tab Facebook Opens in new tab Email Opens in new tab copied You have these already downloaded We have sent you a copy of the report to your email again. Event Details TCS to hold its 30th Annual General Meeting on Thursday, June 19, 2025 at 3:00 p.m IST. through Video Conferencing (“VC”) / Other Audio Visual Means (“OAVM”) Following are the related documents: Stock Exchange Intimation for Record Date Opens in new tab - April 30, 2025 Advertisement Notice for TCS' 30th Annual General Meeting Opens in new tab - May 21, 2025 Annual Return (MGT-7) Opens in new tab - May 27, 2025 Notice of AGM Opens in new tab - May 27, 2025 Procedure for e-voting and joining virtual AGM Opens in new tab - May 27, 2025 TCS Annual Report 2024-25 | 2-Page View Opens in new tab - May 27, 2025 Stock Exchange Intimation for Annual General Meeting and Submission of Integrated Annual Report Opens in new tab - May 27, 2025 FAQs on 30th Annual General Meeting of the Company Opens in new tab - May 27, 2025 Subsidiary Financials Opens in new tab - May 27, 2025 Stock Exchange intimation for Annual Report weblink Letter to Members Opens in new tab - May 28, 2025 Proceeding and details of voting results of the 30th Annual General Meeting Opens in new tab - June 19, 2025 TCS 30th Annual General Meeting 2024-25 This Virtual AGM was conducted through video-conferencing, allowing shareholders from different cities to interact with the management and get their questions answered. Prior to the question and answer session, the attending shareholders were addressed by Mr. Keki Mistry, Chairman for the meeting. This was followed by a presentation by Mr. K Krithivasan, CEO and MD, TCS. Subscribe to our investor updates Register for our email updates to get the freshest takes, straight to your inbox. Register here to Register for our email updates to get the freshest takes, straight to your inbox. Learn more about TCS Financials TCS Strategy IR FAQs Contacts ©2025 TATA Consultancy Services Limited ©2025 TATA Consultancy Services Limited Privacy Notice Cookie Policy Accessibility Declaration Disclaimer Security Policy California Notice at Collection Customize cookies More Facebook Open in New Tab Youtube Open in New Tab Twitter-X Open in New Tab Instagram Open in New Tab linkedin Open in New Tab Contact Contact Press Enter to open an overlay close What’s on your mind? We’re here to help! Tell us what you’re looking for and we’ll get you connected to the right people. Request for Services Investor information Media contacts Looking for something else? Analyst relations CSR Partnership Website feedback We use cookies to give you the best possible experience on our website.When you visit any website, it may store or retrieve information on your browser, mostly in the form of cookies. This information might be about you, your preferences or your device and is mostly used to make the site work as you expect it to. The information does not usually directly identify you, but it can give you a more personalized web experience. Because we respect your right to privacy, you can choose not to allow some types of cookies. However, blocking some types of cookies may impact your experience of the site and the services we are able to offer. To find out more, read our updated Cookie policyCustomize cookies Accept all cookiesYour PrivacyWhen you visit any website, it may store or retrieve information on your browser, mostly in the form of cookies. This information might be about you, your preferences or your device and is mostly used to make the site work as you expect it to. The information does not usually directly identify you, but it can give you a more personalized web experience. Because we respect your right to privacy, you can choose not to allow some types of cookies. Click on the different category headings to find out more and change our default settings. However, blocking some types of cookies may impact your experience of the site and the services we are able to offer. More information ➜Allow all Manage your cookiesStrictly Necessary CookiesAlways ActiveThese cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information.Cookie list‎Functional Cookies Functional Cookies These cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly. Attention to visitors from the EU region: When you choose one or more services from the options below, the main category will be selected. However, only the services you have chosen will be enabled.Cookie list‎Targeting Cookies Targeting Cookies These cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising. Attention to visitors from the EU region: When you choose one or more services from the options below, the main category will be selected. However, only the services you have chosen will be enabled.Cookie list‎Performance Cookies Performance Cookies These cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance. Attention to visitors from the EU region: When you choose one or more services from the options below, the main category will be selected. However, only the services you have chosen will be enabled.Cookie list‎Back ButtonCookie List Search IconFilter IconClear checkbox label labelApply CancelConsent Leg.Interest checkbox label label checkbox label label checkbox label label Save my preferences",
    "text_length": 16133,
    "extraction_date": "2025-08-01T17:50:54.632456",
    "extraction_method": "enhanced_scraper"
  }
]