[
  {
    "company_name": "Tata Consultancy Services",
    "symbol": "TCS",
    "website": "https://www.tcs.com",
    "ir_url": "https://www.tcs.com/investors",
    "report_url": "https://www.tcs.com/investor-relations/events/tcs-thirtieth-agm",
    "report_title": "TCS’ 30th Annual General Meeting\n\n19 Jun 2025\n  Opens in new tab",
    "report_year": 2025,
    "report_type": "page",
    "mda_text": "Pathway’ in its STEM Education Program goIT 03 Jul 2025 TCS Unveils the 2025 Edition of TCS InQuizitive Across 12 Indian Cities, To Spotlight India’s Brightest Young Minds View all Media Kit Investor Relations Press tab for submenu items Tata Consultancy Services Limited NSE:TCS 3,003.00INR -33.80(1.11%) Discover more Q1FY26 Debrief Management Commentary Press tab for submenu items Latest Quarter Commentary Annual Report Section Financials Press tab for submenu items Quarterly Earnings Reports Download TCS Data Sheet Erstwhile CMC Financials News and Events Press tab for submenu items Press Releases Corporate Actions Events Calendar ESG Press tab for submenu items Environment Social Governance Policies and Reports Stakeholder Engagement and Enterprise Risk Management Resources Press tab for submenu items Investor FAQs eTDS Portal Stock Information Analyst Coverage Subsidiaries Subscribe to Investor Updates Unclaimed Dividend Information Worldwide Press tab for submenu items Global knowledge. Local support At TCS, we help enterprises grow through innovative solutions globally. Adapt and thrive with us. Discover more Global Press tab for submenu items Asia Pacific Australia and New Zealand Europe India Middle East and Africa North America United Kingdom Localized Press tab for submenu items China France Germany Japan Netherlands South Korea Sweden Click here or press enter to go to homepage Opens in new tab tata.com logoOpen in New Tab Search What we do Perpetually Adaptive Enterprise Press tab for submenu items Where adaptability meets advantage At TCS, we don’t just help businesses transform. We help them become perpetually adaptive enterprises, built to evolve continuously and confidently in a world of constant change. Adaptability starts here Industries Press tab for submenu items Banking Capital Markets Consumer Packaged Goods and Distribution Communications, Media, and Information Services Education Energy, Resources, and Utilities Healthcare High Tech Insurance Life Sciences Manufacturing Public Services Retail Travel and Logistics Services Press tab for submenu items Artificial Intelligence and Data & Analytics Cloud Cognitive Business Operations Consulting Cybersecurity Enterprise Solutions IoT and Digital Engineering Network Solutions and Services TCS Interactive Sustainability Services Products and Platforms Press tab for submenu items TCS ADD™ TCS BANCS™ TCS BFSI Platforms TCS CHROMA™ TCS Customer Intelligence & Insights™ TCS ERP on Cloud ignio™ TCS iON™ TCS HOBS™ TCS Intelligent Urban Exchange™ TCS OmniStore™ TCS Optumera™ TCS Tap™ Quartz™ – The Smart Ledgers™ TCS TwinX™ TCS MasterCraft™ Jile™ TCS DigiBOLT™ TCS AI WisdomNext™ Perpetually Adaptive Enterprise Industries expand here Banking Capital Markets Consumer Packaged Goods and Distribution Communications, Media, and Information Services Education Energy, Resources, and Utilities Healthcare High Tech Insurance Life Sciences Manufacturing Public Services Retail Travel and Logistics Services expand here Artificial Intelligence and Data & Analytics Cloud Cognitive Business Operations Consulting Cybersecurity Enterprise Solutions IoT and Digital Engineering Network Solutions and Services TCS Interactive Sustainability Services Products and Platforms expand here TCS ADD™ TCS BANCS™ TCS BFSI Platforms TCS CHROMA™ TCS Customer Intelligence & Insights™ TCS ERP on Cloud ignio™ TCS iON™ TCS HOBS™ TCS Intelligent Urban Exchange™ TCS OmniStore™ TCS Optumera™ TCS Tap™ Quartz™ – The Smart Ledgers™ TCS TwinX™ TCS MasterCraft™ Jile™ TCS DigiBOLT™ TCS AI WisdomNext™ Who we are Our Brand Press tab for submenu items With you for the long run Whether it’s running a marathon or helping businesses thrive in applying new technology innovations at scale, we understand what it takes to keep pushing the limits of what’s possible. Discover our brand About Us Press tab for submenu items Leadership Corporate Sustainability Diversity, Equity, and Inclusion Corporate Social Responsibility The TCS Way Alliances Research & Innovation Press tab for submenu items TCS Research TCS Pace™ Our Brand About Us expand here Leadership Corporate Sustainability Diversity, Equity, and Inclusion Corporate Social Responsibility The TCS Way Alliances Research & Innovation expand here TCS Research TCS Pace™ Insights Customer Stories Press tab for submenu items Discover why customers choose TCS We are a digital transformation and technology partner of choice for industry-leading organizations worldwide. Read our customer success stories. Events Press tab for submenu items Upcoming events 29 Sep 2025 TCS BaNCS at SIBOS 2025, Frankfurt 22 Sep 2025 TCS Life Sciences Forum 2025 London 03 Sep 2025 TCS at PostTrade 360°, Stockholm View all Analyst Recognition Press tab for submenu items Recent recognitions 01 Aug 2025 TCS a Leader in Experience-Led HR Transformation Services: NelsonHall 17 Jul 2025 TCS a Leader in Life and Annuities Insurance BPS and Third-Party Administrator Services: Everest Group 15 Jul 2025 TCS Recognized as a Leader in Healthcare Provider Digital Services by Everest Group View all Global Studies Customer Stories Events Analyst Recognition Global Studies Careers Build a future with us Press tab for submenu items Want to be a global change-maker? Join our team. At TCS, we believe exceptional work begins with hiring, celebrating and nurturing the best people — from all walks of life. Join us India Press tab for submenu items India Americas Press tab for submenu items Argentina Brazil Canada Chile Colombia Ecuador Mexico Peru Uruguay USA Asia Pacific Press tab for submenu items Australia Mainland China Hong Kong SAR Indonesia Japan Malaysia New Zealand Philippines Republic of Korea Singapore Chinese Taipei Thailand Europe and UK Press tab for submenu items Belgium Denmark Estonia Finland France Germany Hungary Ireland Italy Luxembourg Netherlands Norway Poland Portugal Spain Sweden Switzerland United Kingdom Middle East and Africa Press tab for submenu items Bahrain Israel Kuwait Qatar Saudi Arabia South Africa United Arab Emirates Build a future with us India expand here India Americas expand here Argentina Brazil Canada Chile Colombia Ecuador Mexico Peru Uruguay USA Asia Pacific expand here Australia Mainland China Hong Kong SAR Indonesia Japan Malaysia New Zealand Philippines Republic of Korea Singapore Chinese Taipei Thailand Europe and UK expand here Belgium Denmark Estonia Finland France Germany Hungary Ireland Italy Luxembourg Netherlands Norway Poland Portugal Spain Sweden Switzerland United Kingdom Middle East and Africa expand here Bahrain Israel Kuwait Qatar Saudi Arabia South Africa United Arab Emirates Newsroom Press Releases Press tab for submenu items Find the latest news about TCS Stay up-to-date on all press announcements by TCS Discover more News Alerts Press tab for submenu items Recent News 16 Jul 2025 TCS Launches AI-Powered Research & Innovation Centre in Singapore to Accelerate Enterprise Innovation at Scale 09 Jul 2025 TCS Launches ‘Gen AI Tech Pathway’ in its STEM Education Program goIT 03 Jul 2025 TCS Unveils the 2025 Edition of TCS InQuizitive Across 12 Indian Cities, To Spotlight India’s Brightest Young Minds View all Media Kit Press Releases News Alerts Media Kit Investors Investor Relations Press tab for submenu items Tata Consultancy Services Limited NSE:TCS 3,003.00INR -33.80(1.11%) Discover more Q1FY26 Debrief Management Commentary Press tab for submenu items Latest Quarter Commentary Annual Report Section Financials Press tab for submenu items Quarterly Earnings Reports Download TCS Data Sheet Erstwhile CMC Financials News and Events Press tab for submenu items Press Releases Corporate Actions Events Calendar ESG Press tab for submenu items Environment Social Governance Policies and Reports Stakeholder Engagement and Enterprise Risk Management Resources Press tab for submenu items Investor FAQs eTDS Portal Stock Information Analyst Coverage Subsidiaries Subscribe to Investor Updates Unclaimed Dividend Information Investor Relations Management Commentary expand here Latest Quarter Commentary Annual Report Section Financials expand here Quarterly Earnings Reports Download TCS Data Sheet Erstwhile CMC Financials News and Events expand here Press Releases Corporate Actions Events Calendar ESG expand here Environment Social Governance Policies and Reports Stakeholder Engagement and Enterprise Risk Management Resources expand here Investor FAQs eTDS Portal Stock Information Analyst Coverage Subsidiaries Subscribe to Investor Updates Unclaimed Dividend Information Worldwide Worldwide Press tab for submenu items Global knowledge. Local support At TCS, we help enterprises grow through innovative solutions globally. Adapt and thrive with us. Discover more Global Press tab for submenu items Asia Pacific Australia and New Zealand Europe India Middle East and Africa North America United Kingdom Localized Press tab for submenu items China France Germany Japan Netherlands South Korea Sweden Worldwide Global expand here Asia Pacific Australia and New Zealand Europe India Middle East and Africa North America United Kingdom Localized expand here China France Germany Japan Netherlands South Korea Sweden Contact us tata.com logo Opens in new tab Mute What are you looking for? Top Results Most Recent Most Recent Oldest first Showing 10 20 30 40 Previous 01 - 07 02 03 04 Next Investor Relations IR Key Events TCS' 30th Annual General Meeting June 19, 2025 Share TCS’ 30th Annual General Meeting Linkedin Opens in new tab X Opens in new tab Facebook Opens in new tab Email Opens in new tab copied You have these already downloaded We have sent you a copy of the report to your email again. Event Details TCS to hold its 30th Annual General Meeting on Thursday, June 19, 2025 at 3:00 p.m IST. through Video Conferencing (“VC”) / Other Audio Visual Means (“OAVM”) Following are the related documents: Stock Exchange Intimation for Record Date Opens in new tab - April 30, 2025 Advertisement Notice for TCS' 30th Annual General Meeting Opens in new tab - May 21, 2025 Annual Return (MGT-7) Opens in new tab - May 27, 2025 Notice of AGM Opens in new tab - May 27, 2025 Procedure for e-voting and joining virtual AGM Opens in new tab - May 27, 2025 TCS Annual Report 2024-25 | 2-Page View Opens in new tab - May 27, 2025 Stock Exchange Intimation for Annual General Meeting and Submission of Integrated Annual Report Opens in new tab - May 27, 2025 FAQs on 30th Annual General Meeting of the Company Opens in new tab - May 27, 2025 Subsidiary Financials Opens in new tab - May 27, 2025 Stock Exchange intimation for Annual Report weblink Letter to Members Opens in new tab - May 28, 2025 Proceeding and details of voting results of the 30th Annual General Meeting Opens in new tab - June 19, 2025 TCS 30th Annual General Meeting 2024-25 This Virtual AGM was conducted through video-conferencing, allowing shareholders from different cities to interact with the management and get their questions answered. Prior to the question and answer session, the attending shareholders were addressed by Mr. Keki Mistry, Chairman for the meeting. This was followed by a presentation by Mr. K Krithivasan, CEO and MD, TCS. Subscribe to our investor updates Register for our email updates to get the freshest takes, straight to your inbox. Register here to Register for our email updates to get the freshest takes, straight to your inbox. Learn more about TCS Financials TCS Strategy IR FAQs Contacts ©2025 TATA Consultancy Services Limited ©2025 TATA Consultancy Services Limited Privacy Notice Cookie Policy Accessibility Declaration Disclaimer Security Policy California Notice at Collection Customize cookies More Facebook Open in New Tab Youtube Open in New Tab Twitter-X Open in New Tab Instagram Open in New Tab linkedin Open in New Tab Contact Contact Press Enter to open an overlay close What’s on your mind? We’re here to help! Tell us what you’re looking for and we’ll get you connected to the right people. Request for Services Investor information Media contacts Looking for something else? Analyst relations CSR Partnership Website feedback We use cookies to give you the best possible experience on our website.When you visit any website, it may store or retrieve information on your browser, mostly in the form of cookies. This information might be about you, your preferences or your device and is mostly used to make the site work as you expect it to. The information does not usually directly identify you, but it can give you a more personalized web experience. Because we respect your right to privacy, you can choose not to allow some types of cookies. However, blocking some types of cookies may impact your experience of the site and the services we are able to offer. To find out more, read our updated Cookie policyCustomize cookies Accept all cookiesYour PrivacyWhen you visit any website, it may store or retrieve information on your browser, mostly in the form of cookies. This information might be about you, your preferences or your device and is mostly used to make the site work as you expect it to. The information does not usually directly identify you, but it can give you a more personalized web experience. Because we respect your right to privacy, you can choose not to allow some types of cookies. Click on the different category headings to find out more and change our default settings. However, blocking some types of cookies may impact your experience of the site and the services we are able to offer. More information ➜Allow all Manage your cookiesStrictly Necessary CookiesAlways ActiveThese cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information.Cookie list‎Functional Cookies Functional Cookies These cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly. Attention to visitors from the EU region: When you choose one or more services from the options below, the main category will be selected. However, only the services you have chosen will be enabled.Cookie list‎Targeting Cookies Targeting Cookies These cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising. Attention to visitors from the EU region: When you choose one or more services from the options below, the main category will be selected. However, only the services you have chosen will be enabled.Cookie list‎Performance Cookies Performance Cookies These cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance. Attention to visitors from the EU region: When you choose one or more services from the options below, the main category will be selected. However, only the services you have chosen will be enabled.Cookie list‎Back ButtonCookie List Search IconFilter IconClear checkbox label labelApply CancelConsent Leg.Interest checkbox label label checkbox label label checkbox label label Save my preferences",
    "text_length": 16133,
    "extraction_date": "2025-08-01T17:50:54.632456",
    "extraction_method": "enhanced_scraper"
  },
  {
    "company_name": "ITC Ltd",
    "symbol": "ITC",
    "website": "https://www.itcportal.com",
    "ir_url": "https://www.itcportal.com/about-itc/investor-relations.aspx",
    "report_url": "https://www.itcportal.com/about-itc/shareholder-value/annual-reports/itc-annual-report-2025/pdf/ITC-Report-and-Accounts-2025.pdf",
    "report_title": "ITC Report & Accounts 2025",
    "report_year": 2025,
    "report_type": "pdf",
    "mda_text": "ologies and a foundation of continuous research and development. The 11 petals on top represent the 11 thriving businesses of the ITC Group, powered by digital adoption across all sectors, as seen in the semi-circular bands below them. The crest of the mnemonic depicts our focus on inclusion, diversity and inspired talent. ContentsBoard of Directors and Committees 01 Your Directors 02 Report on Corporate Governance (including Shareholder Information) 12 Report of the Board of Directors & Management Discussion and Analysis 40 Secretarial Auditor's Report 130 CEO and CFO Compliance Certiﬁcate 137 Standalone Financial Statements ® Balance Sheet 138 ® Statement of Proﬁt and Loss 139 ® Statement of Changes in Equity 140 ® Statement of Cash Flows 142 ® Notes to the Financial Statements 144 Consolidated Financial Statements 231 Ten Years at a Glance 328 Financial Highlights Business Responsibility and Sustainability Report I-LX ITC Infotech: Business Friendly Solutions Creating Enduring Institutions ® Independent Auditor’s Report 210 Guide to Subsidiaries, Joint Ventures & Associates 222 Salient Features of the Financial Statements of Subsidiaries, Joint Ventures & Associates (Form AOC-1) 225 Awards & Accolades ITC: Unleashing New Drivers of Growth & Competitiveness i-xviContents are hyper-linked to the relevant pages of the report Click 'ITC Limited' on the Header/Footer of each page to return to Contents Page  ITC: Unleashing New Drivers of Growth & Competitiveness i The world we live in is marked by challenges emanating from geo-political conﬂicts, uncertainties in global trade and the accelerating climate crisis. Compounding this is the unprecedented rate of digital advancement. These factors are redeﬁning the competitive landscape, compelling enterprises to reframe strategies to stay future-ready. Recognising the challenges, the ITC Next strategy was articulated to scale the next horizon of competitiveness and growth. Strong structural drivers have been put in place to unleash new vectors of growth. Future-ready Portfolio ITC's FMCG businesses continue to build their future-ready portfolio of differentiated products to address evolving needs of consumers. It has envisioned a three-horizon growth strategy that focuses on enhancing its leadership in core businesses, addressing adjacencies and nurturing categories of the future. Through purposeful innovation, premiumisation and personalisation, the Company has strengthened its presence across Branded Packaged Foods, Cigarettes, Personal Care Products, Education & Stationery Products, and Matches and Agarbattis. ITC's Agri Business is deﬁning NextGen Agriculture through ITCMAARS, the phygital ecosystem, Value- Added Agri Products and building climate-resilient value chains. The Paperboards, Paper and Packaging Businesses are expanding their sustainable solutions through innovations that provide eco-friendly alternatives to single-use plastics. ITC has reinforced its leadership in the Value-added Paperboard (VAP) segment by developing customised solutions for end-use industries. Value-Accretive Acquisitions ITC is proactively exploring value-accretive inorganic opportunities as an additional driver of growth. Several acquisitions were announced recently, including Ample Foods (Prasuma and Meatigo), M/s. Sresta Natural Bioproducts (24 Mantra Organic Foods) and Mother Sparsh. A Business Transfer Agreement was signed to acquire Century Pulp & Paper. These new vectors offer strong strategic ﬁt and complement ITC's portfolio while offering signiﬁcant headroom for growth. Resilient Supply Chains ITC has built agile and resilient supply chains anchored in local agri sourcing and strategically located manufacturing hubs. The Company's Integrated Consumer Goods Manufacturing and Logistics (ICMLs) facilities are icons of manufacturing excellence and leverage smart manufacturing, automation and Industry 4.0 technologies to provide structural competitiveness. ITC is also investing in new vectors of growth at the convergence of digital, sustainability and enterprise strengths. ITCMAARS, with Farmer Producer Organisations at the centre, is empowering farmers through personalised advisory, inputs and market linkages. The Company's FoodTech services delivered through cloud kitchens synergise ITC's strengths in Foods and Hotels as well as its Digital capabilities. ITC has embraced a 'Digital First' culture, mainstreaming digital adoption across operations. Under 'Mission DigiArc', a next-generation digital architecture is being implemented across insighting, sourcing, manufacturing, trade marketing, logistics and consumer engagement. Sustainability 2.0 Reimagining sustainability under the pressing challenges of climate change and social inequity, ITC has implemented a Sustainability 2.0 agenda to scale the next horizon of climate action, livelihood generation and community empowerment. ITC has also committed to achieving 'Net Zero Operations' by 2050, which will entail decarbonisation of its Scopes 1 & 2 emissions. Inspired Talent Recognising that talent is one of the most important valuable assets in an organisation, ITC focuses on nurturing world-class talent and developing professional entrepreneurs with a growth mindset. The following pages provide a glimpse into how ITC is enhancing its competitiveness, building resilience and unleashing new growth drivers. Harnessing Digital, Sustainability & Enterprise Strengths  ITC’s Triple Bottom Line Contribution – Highlights EBITDA : ` 24,025 cr 250+ FactoriesFuture-ready Businesses of the ITC Group across Agriculture, Manufacturing and Services11 Corporates in Private Sector in Terms of Contribution to Exchequer Among Top 3World-class Mother Brands25+ of Energy consumed by ITC is from Renewable Sources ~52 % Since FY22 Plastic Neutral Watershed Development : Over18 Lakh Acres CoveredAlliance for Water Stewardship Platinum Certiﬁed Sites 9Afforestation: Over 13 Lakh Acres Greened Sustainable Livelihoods Supported: Nearly 90 Lakh ITCMAARS: Over 20 Lakh Farmer RegistrationsSupport to Education: Nearly 22 Lakh Children BeneﬁttedENVIRONMENTAL ECONOMIC SOCIALClimate Smart Agriculture: Over 31 Lakh Acres Covered Women Reached through Multi-dimensional Programmes: Over 60 LakhMaternal & Child Health and Nutrition: Over Lakh Covered15.2 Skilling: Over1 .2 Lakh Youth Trained iiGross Revenue: ` 73,465 cr Pioneer in Green Buildings:17 buildings with Platinum certiﬁcation (USGBC/IGBC)ITC: Unleashing New Drivers of Growth & Competitiveness  ITC Gr oup – Spanning A gricul ture, Manuf acturing & Servic es F Present in Branded P ackaged Foods, Cigar ettes, P ersonal Care Products, E ducation & Stationery Pr oducts, Agarbattis & Mat ches F India's leading FMC G mark eter F Annual c onsumer spend of over Rs 34,000 cr ores F Exports t o over 70 countries F One of India's leading Agri Business pla yers F Sour cing 35 lakh t onnes; supporting o ver 20 value chain clust ers acr oss 22 stat es F Pioneer in f armer empo werment F Exports t o over 95 c ountries F ITCMAARS c overs o ver 2,050 FPOs; 20 lakh+ farmer r egistrations F Leader in the V alue-added Paperboar ds segment F Implementing sustainable solutions to substitute single-use plastic F Contributing t o ‘Mak e in India’ and import substitution F Pioneer in Industry 4.0 technology adoption F Anchoring local f orestry v alue chains, enhancing gr een c over and supporting liv elihoodsF Whol ly owned subsidiary of ITC Limit ed F Leading global t echnology servic es & solutions pr ovider F Operating in 4 1 countries F Blazeclan Technologies acquisition to accelerate growth F Over 140 hot els in 90+ locations F Pioneer ed the cr edo of ‘Responsible L uxury’ F World's ﬁrst 12 hot els to be LEED® Zer o Carbon and ﬁrst 9 hotels to be LEED® Zer o Water certiﬁed ar e ITC hot els F Embrac ed 'Asset-right' appr oach iiiFMCG Agri Business Paperboards & Packaging Businesses ITC Hotels Limited (Listed Entity)* ITC Infotech *Demer ged and list ed separat ely ITC: Unl eashing New Driv ers of Gr owth & C ompetitiv eness  ITC is building a futur e-ready FMC G portf olio by fortifying core brands, addr essing value-added adjac encies and nurturing new growth drivers. These addr ess evolving consumer needs across health and nutrition, hygiene, naturals, indulgenc e, convenienc e and sustainability . The Compan y is also leveraging purposeful inno vation to offer premium, personalised and high-quality products. ivITC's F utur e-ready P ortfolio FMC G ITC's Branded Packaged Foods Premium Health & Nutrition Convenience Hygiene & Natur al Indulgence ITC: Unl eashing New Driv ers of Gr owth & C ompetitiv eness  v ITC: Unl eashing New Driv ers of Gr owth & C ompetitiv eness  viITC's F utur e-ready P ortfolio Personal Care Products ITC: Unl eashing New Driv ers of Gr owth & C ompetitiv eness  viiEducation & S tationery Products Matches & Ag arbattis ITC's F utur e-ready P ortfolio ITC: Unl eashing New Driv ers of Gr owth & C ompetitiv eness  viiiValue-added A gri Pr oducts Value-added P aperboar ds To accelerat e growth in its Agri Business, IT C continues t o scale up its V alue-added Agri P ortfolio straddling multiple value chains. ITC has str engthened its leadership position in the Value-added P aperboar ds segment by dev eloping customised solutions f or end-use industries. ITC: Unl eashing New Driv ers of Gr owth & C ompetitiv eness  ixDriving Purposef ul Inno vation: ITC Lif e Scienc es & Technol ogy C entr e ITC's Life Sciences & Technology Centre (LSTC) is at the centre of driving innovation in emerging areas important for the future to strengthen the competitiveness of ITC's businesses and brands. ITC-LSTC's Centres of Excellence in Biosciences, Agri-sciences and Materials, and robust research platforms for Beauty & Hygiene, Health & Wellness, Agro-forestry & Crop Sciences and Sustainable Packaging Materials drive world-class innovations. ITC: Nurturing Talent ITC places strong emphasis on nurturing future-ready, world-class talent with a growth mindset. ITC's diverse pool of professional entrepreneurs, or ‘proneurs’, has the unique opportunity to nurture categories, products and brands from ideation to execution, akin to a startup, while being backed by the scale and institutional strengths of a diversiﬁed enterprise. ITC: Unl eashing New Driv ers of Gr owth & C ompetitiv eness  ITC is pursuing value-ac cretive acquisitions to build a portf olio aligned with the evolving consumer needs and business landscape. The emphasis is on opportunities that offer a strong strat egic ﬁt, complement existing portf olios and present signiﬁcant headr oom for growth. The acquisitions focus on categories wher e ITC has a clear right to win, leveraging its enterprise strengths. xITC's R ecent V alue-ac cretive Acquisitions Scaling up IT C's presenc e in the f ast- growing natural and organic f oods spac e. 24 Mantra Organic Building a ful l-stack F rozen, Chil led and R eady t o Cook F oods P ortfolio. Prasuma ITC: Unl eashing New Driv ers of Gr owth & C ompetitiv eness  xi Augmenting IT C Inf otech's capabilities t o servic e customers in a multi-cloud and h ybrid-cloud en vironment to accelerat e growth. Enhancing IT C's mark et presenc e in the 'Good for You' health y snacking spac e.Century Pulp & Paper Blazeclan Technologies Mother Sparsh Yoga BarITC has signed a Business Transf er Agreement t o acquire the Pulp and Paper undertaking of Aditya Birla R eal Estat e Limit ed, a strong strat egic ﬁt with IT C’s Paperboar ds and Paper business. Enabling IT C's P ersonal Car e Products Business to build a cat egory of the futur e in the pr emium ayurv edic and natural baby car e spac e.ITC: Unl eashing New Driv ers of Gr owth & C ompetitiv eness  ITC is pursuing new growth drivers at the intersection of mega trends in digital and sustainability, leveraging its institutional strengths. The scaling up of the FoodTech services, ITCMAARS, as well as sustainable solutions to substitut e single-use plastics exempliﬁes this appr oach. xiiNew Gr owth Driv ers at the C onvergenc e of Digital , Sustainability & Ent erprise Str engths ITC's FoodT ech servic es syner gise the Compan y's strengths in Foods and Hotels as well as Digital capabilities. Operating under 4 brands — ‘ITC Mast er Chef Creations’, ‘ITC Aashirv aad Soul Creations’, ‘ITC Sunf east Baked Creations’, and the newl y launched ‘Sansho by ITC Mast er Chef’ — ITC's FoodT ech servic es are deliv ered through over 55 cloud kitchens in Bengaluru, Chennai, Hyderabad, Mumbai and Pune.FoodT ech ITC: Unl eashing New Driv ers of Gr owth & C ompetitiv eness  xiiiITC's Paperboar ds and Packaging Businesses are promoting scalable, inno vative and sustainable solutions that substitut e single-use plastics. Sustainabl e Solutions ITCMAARS The Compan y has scaled up ITCMAARS (Metamark et for Advanced Agriculture and Rural Services) — a crop- agnostic full stack AgriT ech platform across 11 states. This 'phygital' ecosystem empowers the farming community by delivering AI/ML enabled personalised and dynamic advisory servic es, climate smart technologies as well as hyperlocal offerings, including market linkages, agri inputs and credit enablement. ITC has commissioned a state-of -the-art Moulded Fibre Products manufacturing facility in Madhya Pradesh to provide futuristic packaging solutions made from renewable natural ﬁbres. FiloPack, Fil oServ e, Fil oTub, FiloBev , FiloBowl – Barrier -Coated R ecyclabl e Paperboar ds Leveraging over 2,050 FPOs, ITCMAARS reaches out t o mor e than 20 lakh f armers Replacing plastic containers in f ood deliv eryAn easil y-recyclabl e food grade paper that serv es as a substitut e for aluminium f oil Compostable c oating that pr ovides excellent oil & gr ease resistanc e and heat sealability Paperboar d offering that is a mor e sustainable alt ernativ e to plastic -based indoor advertisingMade from responsibly sourced paper, coated with a compostable barrier, and built to handle food safely - Ecobyte makes it easier to serve with care Unlocking a new paradigm in Sustainability. Moulded Fibre Products from ITC Fibre Innovations LimitedITC: Unl eashing New Driv ers of Gr owth & C ompetitiv eness  xivAccelerated Digital A doption Use of Digital at IT C ITC's vision t o be a FutureTech Ent erprise is po wered by 'Mission DigiAr c', a next-generation smart digital ar chitectur e based on a ' digital ﬁrst ' cultur e. DigiAr c enc ompasses 250+ f actories, 52 war ehouses, over 3,500 distribut ors and 29 lakh r etail ers. ITC Gr een C entr e in K olkata that houses the IT C Inf otech Global AI C entr e of Ex cellenc e Trade, Mark eting & Distribution Logistics Smart C onsumers Agri Sour cing Astra AI t ool Product & Pr ocess Optimisation in Manuf acturing Industry 4.0 technol ogies Enabling liv e tracking of shipmentsSynchr onises end-t o-end planning t o respond t o mark et requir ementsEnabling merchandisers t o audit outlets by capturing k ey metrics f or real-time action Dermaﬁque.com Aashirvaadchakki.com Engageshop.in Fiama.in Classmateshop.in5 D2C channels Collaboration Technology Transformation B2B app f or retailersProviding cust omised outlet-lev el recommendationsCreating cutting-edge Data & Advanc ed Anal ytics capabilities Enabling rural sales-f orce to sharp-tar get mark ets Mobile based application — on-the-go actionables f or the ﬁeld t eam Empow ering cust omers through an integrat ed digital platf ormITC: Unl eashing New Driv ers of Gr owth & C ompetitiv eness Farmer Empow erment ITCMAARS Insights, Mark eting and Content Cr eation 'Sixth Sense' Mark eting Command C entr e and Consumer Data Hub  xvAn A gile & R esilient Suppl y Chain ITC ensures agility and resilience of its supply chains by sourcing raw materials largely from local agri value chains. In addition, the Company's 11 state-of-the-art Integrated Consumer Goods Manufacturing and Logistics (ICML) facilities are located strategically close to large demand centres and provide structural advantages to ITC's FMCG businesses by ensuring product freshness, enhancing agility and responsiveness, reducing cost by lowering distance-to-market, etc. ITC has nurtured a deep and wide omni-channel distribution network to enhance the availability across 70 lakh retail outlets covering length and breadth of India. E-Comm, particularly Q-Comm, is the fastest growing channel for the Company. ITC's stat e-of-the-art Ancil lary Manuf acturing-cum-L ogistics F acilities (AMLF s) at Pudukk ottai, K apurthala and P anchla provide sev eral structural advantages including in ventory optimisation, and dela yering operations Extensiv e Omni-Channel Distribution Netw orkITC: Unl eashing New Driv ers of Gr owth & C ompetitiv eness  xviITC: Transf orming Liv es and Landscapes Net Zero Commitment ITC has c ommitt ed to achiev e Net Zer o Operations by 2050 World-Class ESG Credentials F Sustained ‘AA’ rating by MSCI-ESG for the 7th consecutive year F Included in the Do w Jones Sustainability Emer ging Mark ets Index f or the 5th year in a r owITC's businesses and v alue chains support nearl y 90 lakh sustainable liv elihoodsSupporting Sustainable Livelihoods ITC is the onl y compan y in the w orld t o be water positiv e, carbon positiv e and solid wast e recycling positiv e for nearl y two decadesRene wabl e Ener gy Nearl y 52% of IT C's ener gy is fr om renewable sour ces Afforestation Over 13 lakh acr es greenedWater Stewardship • 35,800+ wat er harv esting structur es • Demand side management: 18 lakh acr es covered • River basin r ejuv enation Climate Smart Agriculture • 12 lakh f armers beneﬁtt ed • Over 31 lakh acr es covered Farmer Empo werment • ITCMAARS: Ov er 2,050 FPOs support ed • 20 lakh+ f armer r egistrationsBiodiversity Conservation Over 6.4 lakh acr es conserv ed Support to W omen Over 60 lakh w omen reached Health & Sanitation • Maternal & Child Health and Nutrition: Over 15 lakh beneﬁciaries covered • Nearly 44,000 individual household toilets constructed Support to Education Nearl y 22 lakh childr en c overed Skilling Over 1.2 lakh youth trained Green Buildings Pioneering the gr een building mov ement in India with a portf olio of USGBC/IGBC Platinum-rat ed buildings• Well-being Out of Waste: Over 2.9 crore citizens covered • Plastic Neutral sinc e 20 21-22 Solid W aste Management ITC: Unl eashing New Driv ers of Gr owth & C ompetitiv eness",
    "text_length": 18394,
    "extraction_date": "2025-08-01T17:53:18.628432",
    "extraction_method": "enhanced_scraper"
  }
]